var quizData = [
    // โจทย์คำเลียนเสียงธรรมชาติ
    {
        quiz: `งั่บงั่บ แบบปลา เป็นต้น กินแบบอร่อย`,
        choices: ['ぱくぱく','ぐっすり','うろうろ','そっと'],
        correct: 1
    },
    {
        quiz: `สูงเพรียว สเลนเดอร์`,
        choices: ['しこしこ','すらっと','ぽんと','ぽかん'],
        correct: 2
    },
    {
        quiz: `ลวก ๆ คร่าว ๆ`,
        choices: ['チン','よろよろ','ざっと','とろとろ'],
        correct: 3
    },
    {
        quiz: `เสียงร้องนกพิราบ`,
        choices: ['ぶんぶん','ぴょん','メエメエ','ポッポ'],
        correct: 4
    },
    {
        quiz: `หลุน ๆ บอลกลิ้ง`,
        choices: ['ころころ','ぱりっと','べたべた','くすくす'],
        correct: 1
    },
    {
        quiz: `แนบสนิท, ตรึงเปร๊ยะ`,
        choices: ['くるくる','ぴっちり','ちりちり','とろん'],
        correct: 2
    },
    {
        quiz: `เก่า, เยิน, โทรม`,
        choices: ['びりっと','ぎっしり','ぼろぼろ','きょろきょろ'],
        correct: 3
    },
    {
        quiz: `ล่องลอย บินไปมาช้า ๆ`,
        choices: ['せっせと','ぎゅうぎゅう','ぼろぼろ','ひらひら'],
        correct: 4
    },
    // โจทย์คำกริยาสุรุ N3
    {
        quiz: `ปรับปรุงแก้ไขให้ดีขึ้น`,
        choices: ['改善する (かいぜん)','覚悟する (かくご)','緊張する (きんちょう)','供給する (きょうきゅう)'],
        correct: 1
    },
    {
        quiz: `วิจารณ์`,
        choices: ['変更する (へんこう)','批判する (ひはん)','承知する (しょうち)','通過する (つうか)'],
        correct: 2
    },
    {
        quiz: `แนะนำ, เสนอ`,
        choices: ['増加する (ぞうか)','逮捕する (たいほ)','推薦する (すいせん)','宿泊する (しゅくはく)'],
        correct: 3
    },
    {
        quiz: `ประเมิน`,
        choices: ['感心する (かんしん)','重視する (じゅうし)','議論する (ぎろん)','評価する (ひょうか)'],
        correct: 4
    },
    // โจทย์ไวยากรณ์ N3
    {
        quiz: `ตลอดจนถึง เช่น จนถึงกลางดึก จนถึงสิ้นปี`,
        choices: ['N + にかけて （は）','N + であることか','N + に関する','N + によって'],
        correct: 1
    },
    {
        quiz: `ทันทีที่.. เช่น ทันทีที่ได้ยิน`,
        choices: ['V + ほど','V た + とたん（に）','V dic + ことがある','V + 切る'],
        correct: 2
    },
    {
        quiz: `เป็นที่น่า.. เช่น เป็นที่น่าสะพรึงที่กระต่ายคาบรองเท้ามา`,
        choices: ['まるで + Adj + ようだ','Adj + （だ）としたら','Adj + (な)ことに','Adj + わけだ'],
        correct: 3
    },
    {
        quiz: `ควร เช่น ควรพักผ่อนให้เพียงพอ`,
        choices: ['V + ながらも','V + につれて','V + そうもない','Vdic + ことだ'],
        correct: 4
    },
    // โจทย์คันจิ N3
    {
        quiz: `กล่องดำ`,
        choices: ['暗箱 (あんばこ)','昏迷 (こんめい)','勤労 (きんろう)','点ける (つける)'],
        correct: 1
    },
    {
        quiz: `การช่วยเหลือ`,
        choices: ['除去 (じょきょ)','救済 (きゅうさい)','費やす (ついやす)','非難 (ひなん)'],
        correct: 2
    },
    {
        quiz: `สนธิสัญญา`,
        choices: ['粉末 (ふんまつ)','付属 (ふぞく)','条約 (じょうやく)','約まる (つづまる)'],
        correct: 3
    },
    {
        quiz: `การบริหาร`,
        choices: ['譲渡 (じょうと)','登校 (とうこう)','探偵 (たんてい)','行政 (ぎょうせい)'],
        correct: 4
    },
    // คลังศัพท์มือถือ
    {
        quiz: `หลังคารั่ว`,
        choices: ['雨漏り (あまもり)','屋根 (やね)','天井裏 (てんじょううら)','屋上 (おくじょう)'],
        correct: 1
    },
    {
        quiz: `ไร้ค่า ไร้สาระ`,
        choices: ['漏り (もり)','くだらない','糞 (くそ)','だらしない'],
        correct: 2
    },
    {
        quiz: `กังวลมากไปในเรื่องไม่สำคัญ จมปลัก พยายามแก้เกินความจำเป็น`,
        choices: ['科目 (かもく)','初々しい (ういういしい)','拘わる (かかわる)','世話になる (せわになる)'],
        correct: 3
    },
    {
        quiz: `ดูแล เอาใจใส่`,
        choices: ['提出する (ていしゅつする)','子供っぽい (こどもっぽい)','責任を取る (せきにんをとる)','面倒を見る (めんどうを見る)'],
        correct: 4
    },
    {
        quiz: `ปล่อยไว้ลำพัง`,
        choices: ['放置 (ほうち)','主に (おもに)','となれば','推論 (すいろん)'],
        correct: 1
    },
    {
        quiz: `สรุปก็คือ.. (สำนวนที่ใช้ในการอนุมาน หรือ สรุปเชิงตรรกะ)`,
        choices: ['主に (おもに)','となれば','推論 (すいろん)','とにかく'],
        correct: 2
    },
    {
        quiz: `เพียงพอ พอใจ มักใช้ในการประเมิน`,
        choices: ['丁寧に (ていねいに)','誠に (まことに)','ろくに','めったに'],
        correct: 3
    },
    {
        quiz: `ไม่มีเวลา/เงิน`,
        choices: ['貧乏 (びんぼう)','のんびり','悔しい (くやしい)','余裕がなく (よゆうがなく)'],
        correct: 4
    },
    {
        quiz: `รายละเอียดเล็ก ๆ`,
        choices: ['細部 (さいぶ)','模様 (もよう)','様子 (ようす)','表す (あらわす)'],
        correct: 1
    },
    {
        quiz: `ปัญญา ความรู้`,
        choices: ['意識 (いしき)','知性 (ちせい)','単位 (たんい)','立場 (たちば)'],
        correct: 2
    },
    {
        quiz: `ค้นหา`,
        choices: ['認める (みとめる)','纏める (まとめる)','検索 (けんさく)','見学 (けんがく)'],
        correct: 3
    },
    {
        quiz: `ลูกชายของตน (คำสุภาพ)`,
        choices: ['おしゃれ','おふくろ','おかず','せがれ'],
        correct: 4
    },
    // คำสุภาพ
    {
        quiz: `เจ้าสำอาง สวย หล่อ มีสไตล์ (คำสุภาพ)`,
        choices: ['おしゃれ','おふくろ','おかず','おやつ'],
        correct: 1
    },
    {
        quiz: `แม่ (คำสุภาพ)`,
        choices: ['おしゃれ','おふくろ','おかず','おやつ'],
        correct: 2
    },
    {
        quiz: `กับข้าว (คำสุภาพ)`,
        choices: ['おしめ','おふくろ','おかず','おやつ'],
        correct: 3
    },
    {
        quiz: `อาหารว่าง (คำสุภาพ)`,
        choices: ['おしめ','おふくろ','おかず','おやつ'],
        correct: 4
    },
    {
        quiz: `ผ้าอ้อม (คำสุภาพ)`,
        choices: ['おしめ','おふくろ','おかず','おやつ'],
        correct: 1
    },
    {
        quiz: `ある (คำสุภาพ)`,
        choices: ['いただく','ございます','おります','いたす'],
        correct: 2
    },
    {
        quiz: `いる (คำสุภาพ)`,
        choices: ['いただく','ございます','おります','いたす'],
        correct: 3
    },
    {
        quiz: `ทำ (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['いただく','ございます','おります','いたす'],
        correct: 4
    },
    {
        quiz: `ทำให้ (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 1
    },
    {
        quiz: `ไป (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 2
    },
    {
        quiz: `ทำ (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 3
    },
    {
        quiz: `พูด (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 4
    },
    {
        quiz: `กลับ (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 1
    },
    {
        quiz: `กลับ (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 2
    },
    {
        quiz: `ดู (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 3
    },
    {
        quiz: `ดู (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 4
    },
    {
        quiz: `รู้จัก (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 1
    },
    {
        quiz: `รู้จัก (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 2
    },
    {
        quiz: `พูด (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 3
    },
    {
        quiz: `รับประทาน (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 4
    },
    {
        quiz: `บ้านของผม (prefix รูปถ่อมตน ใช้กับ...ของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品','わたくしめ','参ります'],
        correct: 1
    },
    {
        quiz: `ของกำนัล/ของขวัญ (prefix รูปถ่อมตน ใช้กับ...ของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品','わたくしめ','参ります'],
        correct: 2
    },
    {
        quiz: `ฉัน (suffix รูปถ่อมตน ใช้กับ...ของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品','わたくしめ','参ります'],
        correct: 3
    },
    {
        quiz: `ไป (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品','わたくしめ','参ります'],
        correct: 4
    },
    // คลังศัพท์มือถือ
    {
        quiz: `สร้างสรรค์`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 1
    },
    {
        quiz: `ฉลาด ปราดเปรื่อง`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 2
    },
    {
        quiz: `นอกจากเรื่องของรสชาติแล้ว...`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 3
    },
    {
        quiz: `ประเคน เสนอ`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 4
    }
];