var quizData = [
    // โจทย์คำเลียนเสียงธรรมชาติ
    {
        quiz: `งั่บงั่บ แบบปลา เป็นต้น กินแบบอร่อย`,
        choices: ['ぱくぱく','ぐっすり','うろうろ','そっと'],
        correct: 1
    },
    {
        quiz: `สูงเพรียว สเลนเดอร์`,
        choices: ['しこしこ','すらっと','ぽんと','ぽかん'],
        correct: 2
    },
    {
        quiz: `ลวก ๆ คร่าว ๆ`,
        choices: ['チン','よろよろ','ざっと','とろとろ'],
        correct: 3
    },
    {
        quiz: `เสียงร้องนกพิราบ`,
        choices: ['ぶんぶん','ぴょん','メエメエ','ポッポ'],
        correct: 4
    },
    {
        quiz: `หลุน ๆ บอลกลิ้ง`,
        choices: ['ころころ','ぱりっと','べたべた','くすくす'],
        correct: 1
    },
    {
        quiz: `แนบสนิท, ตรึงเปร๊ยะ`,
        choices: ['くるくる','ぴっちり','ちりちり','とろん'],
        correct: 2
    },
    {
        quiz: `เก่า, เยิน, โทรม`,
        choices: ['びりっと','ぎっしり','ぼろぼろ','きょろきょろ'],
        correct: 3
    },
    {
        quiz: `ล่องลอย บินไปมาช้า ๆ`,
        choices: ['せっせと','ぎゅうぎゅう','ぼろぼろ','ひらひら'],
        correct: 4
    },
    // โจทย์คำกริยาสุรุ N3
    {
        quiz: `ปรับปรุงแก้ไขให้ดีขึ้น`,
        choices: ['改善する (かいぜん)','覚悟する (かくご)','緊張する (きんちょう)','供給する (きょうきゅう)'],
        correct: 1
    },
    {
        quiz: `วิจารณ์`,
        choices: ['変更する (へんこう)','批判する (ひはん)','承知する (しょうち)','通過する (つうか)'],
        correct: 2
    },
    {
        quiz: `แนะนำ, เสนอ`,
        choices: ['増加する (ぞうか)','逮捕する (たいほ)','推薦する (すいせん)','宿泊する (しゅくはく)'],
        correct: 3
    },
    {
        quiz: `ประเมิน`,
        choices: ['感心する (かんしん)','重視する (じゅうし)','議論する (ぎろん)','評価する (ひょうか)'],
        correct: 4
    },
    // โจทย์ไวยากรณ์ N3
    {
        quiz: `ตลอดจนถึง เช่น จนถึงกลางดึก จนถึงสิ้นปี`,
        choices: ['N + にかけて （は）','N + であることか','N + に関する','N + によって'],
        correct: 1
    },
    {
        quiz: `ทันทีที่.. เช่น ทันทีที่ได้ยิน`,
        choices: ['V + ほど','V た + とたん（に）','V dic + ことがある','V + 切る'],
        correct: 2
    },
    {
        quiz: `เป็นที่น่า.. เช่น เป็นที่น่าสะพรึงที่กระต่ายคาบรองเท้ามา`,
        choices: ['まるで + Adj + ようだ','Adj + （だ）としたら','Adj + (な)ことに','Adj + わけだ'],
        correct: 3
    },
    {
        quiz: `ควร เช่น ควรพักผ่อนให้เพียงพอ`,
        choices: ['V + ながらも','V + につれて','V + そうもない','Vdic + ことだ'],
        correct: 4
    },
    // โจทย์คันจิ N3
    {
        quiz: `กล่องดำ`,
        choices: ['暗箱 (あんばこ)','昏迷 (こんめい)','勤労 (きんろう)','点ける (つける)'],
        correct: 1
    },
    {
        quiz: `การช่วยเหลือ`,
        choices: ['除去 (じょきょ)','救済 (きゅうさい)','費やす (ついやす)','非難 (ひなん)'],
        correct: 2
    },
    {
        quiz: `สนธิสัญญา`,
        choices: ['粉末 (ふんまつ)','付属 (ふぞく)','条約 (じょうやく)','約まる (つづまる)'],
        correct: 3
    },
    {
        quiz: `การบริหาร`,
        choices: ['譲渡 (じょうと)','登校 (とうこう)','探偵 (たんてい)','行政 (ぎょうせい)'],
        correct: 4
    },
    // คลังศัพท์มือถือ
    {
        quiz: `หลังคารั่ว`,
        choices: ['雨漏り (あまもり)','屋根 (やね)','天井裏 (てんじょううら)','屋上 (おくじょう)'],
        correct: 1
    },
    {
        quiz: `ไร้ค่า ไร้สาระ`,
        choices: ['漏り (もり)','くだらない','糞 (くそ)','だらしない'],
        correct: 2
    },
    {
        quiz: `กังวลมากไปในเรื่องไม่สำคัญ จมปลัก พยายามแก้เกินความจำเป็น`,
        choices: ['科目 (かもく)','初々しい (ういういしい)','拘わる (かかわる)','世話になる (せわになる)'],
        correct: 3
    },
    {
        quiz: `ดูแล เอาใจใส่`,
        choices: ['提出する (ていしゅつする)','子供っぽい (こどもっぽい)','責任を取る (せきにんをとる)','面倒を見る (めんどうを見る)'],
        correct: 4
    },
    {
        quiz: `ปล่อยไว้ลำพัง`,
        choices: ['放置 (ほうち)','主に (おもに)','となれば','推論 (すいろん)'],
        correct: 1
    },
    {
        quiz: `สรุปก็คือ.. (สำนวนที่ใช้ในการอนุมาน หรือ สรุปเชิงตรรกะ)`,
        choices: ['主に (おもに)','となれば','推論 (すいろん)','とにかく'],
        correct: 2
    },
    {
        quiz: `เพียงพอ พอใจ มักใช้ในการประเมิน`,
        choices: ['丁寧に (ていねいに)','誠に (まことに)','ろくに','めったに'],
        correct: 3
    },
    {
        quiz: `ไม่มีเวลา/เงิน`,
        choices: ['貧乏 (びんぼう)','のんびり','悔しい (くやしい)','余裕がなく (よゆうがなく)'],
        correct: 4
    },
    {
        quiz: `รายละเอียดเล็ก ๆ`,
        choices: ['細部 (さいぶ)','模様 (もよう)','様子 (ようす)','表す (あらわす)'],
        correct: 1
    },
    {
        quiz: `ปัญญา ความรู้`,
        choices: ['意識 (いしき)','知性 (ちせい)','単位 (たんい)','立場 (たちば)'],
        correct: 2
    },
    {
        quiz: `ค้นหา (search)`,
        choices: ['認める (みとめる)','纏める (まとめる)','検索 (けんさく)','見学 (けんがく)'],
        correct: 3
    },
    {
        quiz: `ลูกชายของตน (คำสุภาพ)`,
        choices: ['おしゃれ','おふくろ','おかず','せがれ'],
        correct: 4
    },
    // คำสุภาพ
    {
        quiz: `เจ้าสำอาง สวย หล่อ มีสไตล์ (คำสุภาพ)`,
        choices: ['おしゃれ','おふくろ','おかず','おやつ'],
        correct: 1
    },
    {
        quiz: `แม่ (คำสุภาพ)`,
        choices: ['おしゃれ','おふくろ','おかず','おやつ'],
        correct: 2
    },
    {
        quiz: `กับข้าว (คำสุภาพ)`,
        choices: ['おしめ','おふくろ','おかず','おやつ'],
        correct: 3
    },
    {
        quiz: `อาหารว่าง (คำสุภาพ)`,
        choices: ['おしめ','おふくろ','おかず','おやつ'],
        correct: 4
    },
    {
        quiz: `ผ้าอ้อม (คำสุภาพ)`,
        choices: ['おしめ','おふくろ','おかず','おやつ'],
        correct: 1
    },
    {
        quiz: `ある (คำสุภาพ)`,
        choices: ['いただく','ございます','おります','いたす'],
        correct: 2
    },
    {
        quiz: `いる (คำสุภาพ)`,
        choices: ['いただく','ございます','おります','いたす'],
        correct: 3
    },
    {
        quiz: `ทำ (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['いただく','ございます','おります','いたす'],
        correct: 4
    },
    {
        quiz: `ทำให้ (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 1
    },
    {
        quiz: `ไป (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 2
    },
    {
        quiz: `ทำ (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 3
    },
    {
        quiz: `พูด (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['させていただく','伺う (うかがう)','なさる','おっしゃる'],
        correct: 4
    },
    {
        quiz: `กลับ (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 1
    },
    {
        quiz: `กลับ (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 2
    },
    {
        quiz: `ดู (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 3
    },
    {
        quiz: `ดู (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['お帰りになる','失礼する','ご覧になる','拝見する'],
        correct: 4
    },
    {
        quiz: `รู้จัก (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 1
    },
    {
        quiz: `รู้จัก (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 2
    },
    {
        quiz: `พูด (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 3
    },
    {
        quiz: `รับประทาน (รูปยกย่อง ใช้กับการกระทำของคู่สนทนา)`,
        choices: ['ご存じ','存じ上げる','申し上げる','召し上がる'],
        correct: 4
    },
    {
        quiz: `บ้านของผม (prefix รูปถ่อมตน ใช้กับ...ของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品 (そしな)','わたくしめ','参ります (まいります)'],
        correct: 1
    },
    {
        quiz: `ของกำนัล/ของขวัญ (prefix รูปถ่อมตน ใช้กับ...ของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品 (そしな)','わたくしめ','参ります (まいります)'],
        correct: 2
    },
    {
        quiz: `ฉัน (suffix รูปถ่อมตน ใช้กับ...ของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品 (そしな)','わたくしめ','参ります (まいります)'],
        correct: 3
    },
    {
        quiz: `ไป (รูปถ่อมตน ใช้กับการกระทำของผู้พูด)`,
        choices: ['拙宅 (せっか/せったく)','粗品 (そしな)','わたくしめ','参ります (まいります)'],
        correct: 4
    },
    // คลังศัพท์มือถือ
    {
        quiz: `สร้างสรรค์`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 1
    },
    {
        quiz: `ฉลาด ปราดเปรื่อง`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 2
    },
    {
        quiz: `นอกจากเรื่องของรสชาติแล้ว...`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 3
    },
    {
        quiz: `ประเคน เสนอ`,
        choices: ['工夫する (くふう)','機敏 (きびん)','味はともかく','献上する (けんじょう)'],
        correct: 4
    },
    {
        quiz: `ดีกว่า`,
        choices: ['マシな','尽きる (つきる)','名乗る','言い分は通るまい'],
        correct: 1
    },
    {
        quiz: `หมดแรง เหนื่อย`,
        choices: ['マシな','尽きる (つきる)','名乗る','言い分は通るまい'],
        correct: 2
    },
    {
        quiz: `เรียกตัวเองว่า..`,
        choices: ['マシな','尽きる (つきる)','名乗る','言い分は通るまい'],
        correct: 3
    },
    {
        quiz: `ข้อโต้แย้งไม่สมเหตุสมผล`,
        choices: ['マシな','尽きる (つきる)','名乗る','言い分は通るまい'],
        correct: 4
    },
    {
        quiz: `ยุ่งเหยิง`,
        choices: ['散々な (さんざん)','懇願 (こんがん)','齧る (かじる)','涎 (よだれ)'],
        correct: 1
    },
    {
        quiz: `วิงวอน`,
        choices: ['散々な (さんざん)','懇願 (こんがん)','齧る (かじる)','涎 (よだれ)'],
        correct: 2
    },
    {
        quiz: `แทะ`,
        choices: ['散々な (さんざん)','懇願 (こんがん)','齧る (かじる)','涎 (よだれ)'],
        correct: 3
    },
    {
        quiz: `น้ำลาย`,
        choices: ['散々な (さんざん)','懇願 (こんがん)','齧る (かじる)','涎 (よだれ)'],
        correct: 4
    },
    {
        quiz: `มาถึง`,
        choices: ['至る (いたる)','領域 (りょういき)','展開 (てんかい)','途轍もない (とてつもない)'],
        correct: 1
    },
    {
        quiz: `เขตแดน`,
        choices: ['至る (いたる)','領域 (りょういき)','展開 (てんかい)','途轍もない (とてつもない)'],
        correct: 2
    },
    {
        quiz: `การขยาย`,
        choices: ['至る (いたる)','領域 (りょういき)','展開 (てんかい)','途轍もない (とてつもない)'],
        correct: 3
    },
    {
        quiz: `มิอาจหยั่งถึง พลังเหลือล้น`,
        choices: ['至る (いたる)','領域 (りょういき)','展開 (てんかい)','途轍もない (とてつもない)'],
        correct: 4
    },
    {
        quiz: `องค์ประกอบ`,
        choices: ['構成 (こうせい)','意義 (いぎ)','自尊心 (じそんしん)','出自 (しゅつじ)'],
        correct: 1
    },
    {
        quiz: `ความสำคัญ / ความหมาย`,
        choices: ['構成 (こうせい)','意義 (いぎ)','自尊心 (じそんしん)','出自 (しゅつじ)'],
        correct: 2
    },
    {
        quiz: `การเคารพนับถือตนเอง (Self-esteem)`,
        choices: ['構成 (こうせい)','意義 (いぎ)','自尊心 (じそんしん)','出自 (しゅつじ)'],
        correct: 3
    },
    {
        quiz: `สถานที่เกิด หรือ ต้นกำเนิด`,
        choices: ['構成 (こうせい)','意義 (いぎ)','自尊心 (じそんしん)','出自 (しゅつじ)'],
        correct: 4
    },
    {
        quiz: `ความถนัด`,
        choices: ['適性 (てきせい)','検査 (けんさ)','腹を満たした (はらをみたした)','ドブネズミ'],
        correct: 1
    },
    {
        quiz: `การทดสอบ (Inspection)`,
        choices: ['適性 (てきせい)','検査 (けんさ)','腹を満たした (はらをみたした)','ドブネズミ'],
        correct: 2
    },
    {
        quiz: `เติมท้องให้อิ่ม`,
        choices: ['適性 (てきせい)','検査 (けんさ)','腹を満たした (はらをみたした)','ドブネズミ'],
        correct: 3
    },
    {
        quiz: `หนูท่อ/หนูบ้าน (Brown Rat) มีทั้งสีน้ำตาล และสีเทา`,
        choices: ['適性 (てきせい)','検査 (けんさ)','腹を満たした (はらをみたした)','ドブネズミ'],
        correct: 4
    },
    {
        quiz: `จิบ`,
        choices: ['すすり','白髪 (しらが)','候補 (こうほ)','活躍する (かつやく)'],
        correct: 1
    },
    {
        quiz: `ผมหงอก`,
        choices: ['すすり','白髪 (しらが)','候補 (こうほ)','活躍する (かつやく)'],
        correct: 2
    },
    {
        quiz: `ผู้สมัคร`,
        choices: ['すすり','白髪 (しらが)','候補 (こうほ)','活躍する (かつやく)'],
        correct: 3
    },
    {
        quiz: `สวมบทบาท`,
        choices: ['すすり','白髪 (しらが)','候補 (こうほ)','活躍する (かつやく)'],
        correct: 4
    },
    {
        quiz: `จม`,
        choices: ['溺れる (おぼれる)','孤児院 (みなしごいん)','もろに','矛 (ほこ)'],
        correct: 1
    },
    {
        quiz: `สถานเด็กกำพร้า`,
        choices: ['溺れる (おぼれる)','孤児院 (みなしごいん)','もろに','矛 (ほこ)'],
        correct: 2
    },
    {
        quiz: `สุดโต่ง สมบูรณ์ ไม่เบี่ยงเบน`,
        choices: ['溺れる (おぼれる)','孤児院 (みなしごいん)','もろに','矛 (ほこ)'],
        correct: 3
    },
    {
        quiz: `หอก`,
        choices: ['溺れる (おぼれる)','孤児院 (みなしごいん)','もろに','矛 (ほこ)'],
        correct: 4
    },
    {
        quiz: `แหลกเป็นเสี่ยง`,
        choices: ['粉々に (こなごなに)','奥の手 (おくのて)','触手 (しょくしゅ)','盾 (たて)'],
        correct: 1
    },
    {
        quiz: `อาวุธลับ ไพ่ตาย`,
        choices: ['粉々に (こなごなに)','奥の手 (おくのて)','触手 (しょくしゅ)','盾 (たて)'],
        correct: 2
    },
    {
        quiz: `หนวด (Tentacles)`,
        choices: ['粉々に (こなごなに)','奥の手 (おくのて)','触手 (しょくしゅ)','盾 (たて)'],
        correct: 3
    },
    {
        quiz: `โล่ (Shield)`,
        choices: ['粉々に (こなごなに)','奥の手 (おくのて)','触手 (しょくしゅ)','盾 (たて)'],
        correct: 4
    },
    {
        quiz: `น่าขันไร้สาระ`,
        choices: ['笑止千万 (しょうしせんばん)','悪食 (あくじき)','便宜上 (べんぎじょう)','大層 (たいそう)'],
        correct: 1
    },
    {
        quiz: `การกินในสิ่งที่ปกติคนธรรมดาไม่กิน เช่น กินศากศพ`,
        choices: ['笑止千万 (しょうしせんばん)','悪食 (あくじき)','便宜上 (べんぎじょう)','大層 (たいそう)'],
        correct: 2
    },
    {
        quiz: `เพื่อความสะดวก เพื่อความเข้าใจง่าย`,
        choices: ['笑止千万 (しょうしせんばん)','悪食 (あくじき)','便宜上 (べんぎじょう)','大層 (たいそう)'],
        correct: 3
    },
    {
        quiz: `อย่างมาก`,
        choices: ['笑止千万 (しょうしせんばん)','悪食 (あくじき)','便宜上 (べんぎじょう)','大層 (たいそう)'],
        correct: 4
    },
    {
        quiz: `เหือดแห้ง, ขาดพร่องในทรัพยากรหรือความสามารถ`,
        choices: ['枯渇 (こかつ)','在り方 (ありかた)','風情 (ふぜい)','崇高 (すうこう)'],
        correct: 1
    },
    {
        quiz: `มีตัวตน`,
        choices: ['枯渇 (こかつ)','在り方 (ありかた)','風情 (ふぜい)','崇高 (すうこう)'],
        correct: 2
    },
    {
        quiz: `กลิ่นอาย, บรรยากาศ`,
        choices: ['枯渇 (こかつ)','在り方 (ありかた)','風情 (ふぜい)','崇高 (すうこう)'],
        correct: 3
    },
    {
        quiz: `ประเสริฐ`,
        choices: ['枯渇 (こかつ)','在り方 (ありかた)','風情 (ふぜい)','崇高 (すうこう)'],
        correct: 4
    },
    {
        quiz: `นิทรรศการ`,
        choices: ['展覧 (てんらん)','うつ伏せ (うつぶせ)','仰向け (あおむけ)','半端ない (はんぱない)'],
        correct: 1
    },
    {
        quiz: `นอนคว่ำหน้า`,
        choices: ['展覧 (てんらん)','うつ伏せ (うつぶせ)','仰向け (あおむけ)','半端ない (はんぱない)'],
        correct: 2
    },
    {
        quiz: `นอนหงาย / แนบหลัง`,
        choices: ['展覧 (てんらん)','うつ伏せ (うつぶせ)','仰向け (あおむけ)','半端ない (はんぱない)'],
        correct: 3
    },
    {
        quiz: `ไม่ใช่เล่น ๆ เช่น อร่อยไม่ใช่เล่น ความหมายแบบแปลตรงตัวคือไม่ครึ่ง ๆ กลาง ๆ`,
        choices: ['展覧 (てんらん)','うつ伏せ (うつぶせ)','仰向け (あおむけ)','半端ない (はんぱない)'],
        correct: 4
    },
    {
        quiz: `เข้าใจ/ยอมรับ`,
        choices: ['承知する (しょうち)','敬意 (けいい)','柄 (え)','吸収 (きゅうしゅう)'],
        correct: 1
    },
    {
        quiz: `เคารพ`,
        choices: ['承知する (しょうち)','敬意 (けいい)','柄 (え)','吸収 (きゅうしゅう)'],
        correct: 2
    },
    {
        quiz: `ด้ามจับ / หน่วยนับสิ่งของที่ถืออยู่ในมือ เช่น ดาบ หอก เป็นต้น`,
        choices: ['承知する (しょうち)','敬意 (けいい)','柄 (え)','吸収 (きゅうしゅう)'],
        correct: 3
    },
    {
        quiz: `การดูดกลืน`,
        choices: ['承知する (しょうち)','敬意 (けいい)','柄 (え)','吸収 (きゅうしゅう)'],
        correct: 4
    },
    {
        quiz: `พัดกระดาษ`,
        choices: ['扇子 (せんす)','お揃いの... (おそろいの...)','現象 (げんしょう)','減少 (げんしょう)'],
        correct: 1
    },
    {
        quiz: `ของที่เข้าคู่กัน เช่น เสื้อผ้า แหวน มักเอาไปมอบให้แฟน หรือบัดดี้`,
        choices: ['扇子 (せんす)','お揃いの... (おそろいの...)','現象 (げんしょう)','減少 (げんしょう)'],
        correct: 2
    },
    {
        quiz: `ปรากฏการณ์ธรรมชาติ`,
        choices: ['扇子 (せんす)','お揃いの... (おそろいの...)','現象 (げんしょう)','減少 (げんしょう)'],
        correct: 3
    },
    {
        quiz: `ลดลง เช่น ประชากรลดลง`,
        choices: ['扇子 (せんす)','お揃いの... (おそろいの...)','現象 (げんしょう)','減少 (げんしょう)'],
        correct: 4
    },
    {
        quiz: `จริงจัง`,
        choices: ['深刻 (しんこく)','障壁 (しょうへき)','貫く (つらぬく)','糞 (くそ)'],
        correct: 1
    },
    {
        quiz: `บาเรีย`,
        choices: ['深刻 (しんこく)','障壁 (しょうへき)','貫く (つらぬく)','糞 (くそ)'],
        correct: 2
    },
    {
        quiz: `แทงทะลุ`,
        choices: ['深刻 (しんこく)','障壁 (しょうへき)','貫く (つらぬく)','糞 (くそ)'],
        correct: 3
    },
    {
        quiz: `ไอเวร (คำสบถ)`,
        choices: ['深刻 (しんこく)','障壁 (しょうへき)','貫く (つらぬく)','糞 (くそ)'],
        correct: 4
    },
    {
        quiz: `มูลค่า`,
        choices: ['値 (あたい)','伝説 (でんせつ)','支配 (しはい)','焦る (あせる)'],
        correct: 1
    },
    {
        quiz: `ตำนาน`,
        choices: ['値 (あたい)','伝説 (でんせつ)','支配 (しはい)','焦る (あせる)'],
        correct: 2
    },
    {
        quiz: `ปกครอง`,
        choices: ['値 (あたい)','伝説 (でんせつ)','支配 (しはい)','焦る (あせる)'],
        correct: 3
    },
    {
        quiz: `แตกตื่น`,
        choices: ['値 (あたい)','伝説 (でんせつ)','支配 (しはい)','焦る (あせる)'],
        correct: 4
    },
    {
        quiz: `ต้องการ/แสวงหา`,
        choices: ['求める (もとめる)','如何にも (いかにも)','庇護 (ひご)','保証 (ほしょう)'],
        correct: 1
    },
    {
        quiz: `จริง แสดงความเห็นด้วยอย่างแรงกับความคิดคนอื่น`,
        choices: ['求める (もとめる)','如何にも (いかにも)','庇護 (ひご)','保証 (ほしょう)'],
        correct: 2
    },
    {
        quiz: `การคุ้มกัน`,
        choices: ['求める (もとめる)','如何にも (いかにも)','庇護 (ひご)','保証 (ほしょう)'],
        correct: 3
    },
    {
        quiz: `ประกัน/รับรอง`,
        choices: ['求める (もとめる)','如何にも (いかにも)','庇護 (ひご)','保証 (ほしょう)'],
        correct: 4
    },
    {
        quiz: `คำราม`,
        choices: ['咆哮 (ほうこう)','亜空間 (あくうかん)','隔絶 (かくぜつ)','抗う (あらがう)'],
        correct: 1
    },
    {
        quiz: `ห้วงมิติ มิติจินตนาการที่กฏฟิสิกส์ทั่วไปไม่สามารถใช้ได้ ส่วนใหญ่ใช้กับนิยายวิทยาศาสตร์`,
        choices: ['咆哮 (ほうこう)','亜空間 (あくうかん)','隔絶 (かくぜつ)','抗う (あらがう)'],
        correct: 2
    },
    {
        quiz: `การแยกตัวออกมา`,
        choices: ['咆哮 (ほうこう)','亜空間 (あくうかん)','隔絶 (かくぜつ)','抗う (あらがう)'],
        correct: 3
    },
    {
        quiz: `ต่อต้าน`,
        choices: ['咆哮 (ほうこう)','亜空間 (あくうかん)','隔絶 (かくぜつ)','抗う (あらがう)'],
        correct: 4
    },
    {
        quiz: `กาลครั้งหนึ่งนานมาแล้ว`,
        choices: ['かつては','虐げる (しいたげる)','蔑む (さげすむ)','奴隷 (どれい)'],
        correct: 1
    },
    {
        quiz: `การกดขี่ หมายถึง ฝ่ายที่มีอำนาจทำให้ฝ่ายที่อ่อนแอกว่าทุกข์ทรมานด้วยปฏิบัติการอันโหดร้าย`,
        choices: ['かつては','虐げる (しいたげる)','蔑む (さげすむ)','奴隷 (どれい)'],
        correct: 2
    },
    {
        quiz: `ดูถูก / ดูหมิ่น / ชัง / ปรามาสว่าอีกฝ่ายด้อยกว่า`,
        choices: ['かつては','虐げる (しいたげる)','蔑む (さげすむ)','奴隷 (どれい)'],
        correct: 3
    },
    {
        quiz: `ทาส`,
        choices: ['かつては','虐げる (しいたげる)','蔑む (さげすむ)','奴隷 (どれい)'],
        correct: 4
    },
    {
        quiz: `แปลว่ารับแหละ แต่คันจิตัวนี้ รับมาด้วยความรู้สึกขอบคุณ รับพรจากเทพ เป็นต้น`,
        choices: ['享ける (うける)','介入 (かいにゅう)','圧倒的 (あっとうてき)','巻末 (かんまつ)'],
        correct: 1
    },
    {
        quiz: `แทรกแซง`,
        choices: ['享ける (うける)','介入 (かいにゅう)','圧倒的 (あっとうてき)','巻末 (かんまつ)'],
        correct: 2
    },
    {
        quiz: `เหนือชั้นกว่าแบบเทียบเคียงไม่ได้`,
        choices: ['享ける (うける)','介入 (かいにゅう)','圧倒的 (あっとうてき)','巻末 (かんまつ)'],
        correct: 3
    },
    {
        quiz: `บทส่งท้ายเล่มหนังสือ`,
        choices: ['享ける (うける)','介入 (かいにゅう)','圧倒的 (あっとうてき)','巻末 (かんまつ)'],
        correct: 4
    },
    {
        quiz: `ต้นฉบับ (งาน original) หมายถึง การเผยแพร่ผลงานลงหนังสือ โดยยังไม่ผ่านตัวแทนจำหน่ายอื่น`,
        choices: ['描き下ろし (かきおろし)','躾ける (しつける)','衰える (おとろえる)','果たす (はたす)'],
        correct: 1
    },
    {
        quiz: `สั่งสอน/ฝึก ให้รู้จักมารยาท/ระเบียบ`,
        choices: ['描き下ろし (かきおろし)','躾ける (しつける)','衰える (おとろえる)','果たす (はたす)'],
        correct: 2
    },
    {
        quiz: `สูญเสียพลัง พลังชีวิต พลังกาย เป็นต้น`,
        choices: ['描き下ろし (かきおろし)','躾ける (しつける)','衰える (おとろえる)','果たす (はたす)'],
        correct: 3
    },
    {
        quiz: `เติมเต็ม`,
        choices: ['描き下ろし (かきおろし)','躾ける (しつける)','衰える (おとろえる)','果たす (はたす)'],
        correct: 4
    },
    {
        quiz: `จุติ/เกิดใหม่`,
        choices: ['降臨 (こうりん)','復活 (ふっかつ)','現世 (うつしよ)','依代 (よりしろ)'],
        correct: 1
    },
    {
        quiz: `ชุบชีวิต`,
        choices: ['降臨 (こうりん)','復活 (ふっかつ)','現世 (うつしよ)','依代 (よりしろ)'],
        correct: 2
    },
    {
        quiz: `โลกที่มนุษย์อาศัยอยู่ (ลัทธิชินโต) ตรงข้ามกับ 常世（とこよ）สวรรค์ และ 常夜（とこよ）นรก`,
        choices: ['降臨 (こうりん)','復活 (ふっかつ)','現世 (うつしよ)','依代 (よりしろ)'],
        correct: 3
    },
    {
        quiz: `ร่างทรง (ลัทธิชินโต) หมายถึง วัตถุที่เทพสถิตอยู่ อาจหมายรวมถึงพื้นที่ศักดิ์สิทธิ์ด้วยก็ได้`,
        choices: ['降臨 (こうりん)','復活 (ふっかつ)','現世 (うつしよ)','依代 (よりしろ)'],
        correct: 4
    },
    {
        quiz: `ดูหมิ่นพระเจ้า/หลบหลู่สิ่งศักดิ์สิทธิ์ (Blasphemy)`,
        choices: ['冒涜 (ぼうとく)','滴 (しずく)','うがい薬 (うがいぐすり)','大切にする (たいせつにする)'],
        correct: 1
    },
    {
        quiz: `หยดน้ำ`,
        choices: ['冒涜 (ぼうとく)','滴 (しずく)','うがい薬 (うがいぐすり)','大切にする (たいせつにする)'],
        correct: 2
    },
    {
        quiz: `น้ำยาบ้วนปาก`,
        choices: ['冒涜 (ぼうとく)','滴 (しずく)','うがい薬 (うがいぐすり)','大切にする (たいせつにする)'],
        correct: 3
    },
    {
        quiz: `หวงแหน ทะนุถนอม`,
        choices: ['冒涜 (ぼうとく)','滴 (しずく)','うがい薬 (うがいぐすり)','大切にする (たいせつにする)'],
        correct: 4
    },
    {
        quiz: `การยื่นคำร้อง/ยื่นสมัคร เพื่อขออนุญาต อนุมัติ ไปยังองค์กรภาครัฐหรือเอกชน โดยทั่วไปคือการทำตามกระบวนการบางอย่างขององค์กร เพื่อเติมเต็มความปรารถนาของคนคนหนึ่ง`,
        choices: ['申請 (しんせい)','大抵 (たいてい)','通って (かよって)','隅 (すみ)'],
        correct: 1
    },
    {
        quiz: `โดยปกติ มักจะ (usually)`,
        choices: ['申請 (しんせい)','大抵 (たいてい)','通って (かよって)','隅 (すみ)'],
        correct: 2
    },
    {
        quiz: `ไปมาหาสู่ เช่น เวลาอยู่หอใกล้บ้าน และแวะไปเยี่ยมคนที่บ้าน จะใช้คำนี้ (จะมีคำอ่านเฉพาะของความหมายนี้อยู่)`,
        choices: ['申請 (しんせい)','大抵 (たいてい)','通って (かよって)','隅 (すみ)'],
        correct: 3
    },
    {
        quiz: `มุม เช่น มุมห้อง (corner)`,
        choices: ['申請 (しんせい)','大抵 (たいてい)','通って (かよって)','隅 (すみ)'],
        correct: 4
    },
    {
        quiz: `กระดาษช่องสี่เหลี่ยม สำหรับเขียน/คัดตัวอักษรภาษาญี่ปุ่น (Manuscript Paper)`,
        choices: ['原稿用紙 (げんこうようし)','伺って (うかがって)','移られる (うつられる)','視点 (してん)'],
        correct: 1
    },
    {
        quiz: `ถาม (ใช้คันจิตัวเดียวกับคำว่า "ไป" ที่เป็นคำถ่อมตน ระวังการใช้งานนิดนึง)`,
        choices: ['原稿用紙 (げんこうようし)','伺って (うかがって)','移られる (うつられる)','視点 (してん)'],
        correct: 2
    },
    {
        quiz: `ถูกเคลื่อนย้าย`,
        choices: ['原稿用紙 (げんこうようし)','伺って (うかがって)','移られる (うつられる)','視点 (してん)'],
        correct: 3
    },
    {
        quiz: `สถานที่ที่คนมองไป หรือใช้กับ มุมมองความคิดของคน ก็ได้`,
        choices: ['原稿用紙 (げんこうようし)','伺って (うかがって)','移られる (うつられる)','視点 (してん)'],
        correct: 4
    },
    {
        quiz: `เล่น (ดนตรี) ได้`,
        choices: ['弾ける (はじける)','請求書 (せいきゅうしょ)','意欲 (いよく)','でたらめに'],
        correct: 1
    },
    {
        quiz: `ใบแจ้งหนี้ ที่หมายถึง เอกสารที่ผู้ค้าออกให้ลูกค้า เพื่อเก็บค่าใช้จ่ายในบริการหรือสินค้า และป้องกันการคาดเคลื่อนหรือหลงลืม ในที่นี้คือยังไม่จ่ายเงิน (จ่ายเงินแล้วเรียก 領収書)`,
        choices: ['弾ける (はじける)','請求書 (せいきゅうしょ)','意欲 (いよく)','でたらめに'],
        correct: 2
    },
    {
        quiz: `แรงบันดาลใจ ความปรารถนาที่จะเดินหน้าแบบ proactive เช่น ต้องการหาคนเก่ง หลงใหลในงานวิจัย`,
        choices: ['弾ける (はじける)','請求書 (せいきゅうしょ)','意欲 (いよく)','でたらめに'],
        correct: 3
    },
    {
        quiz: `การพูด/ทำเรื่อยเปื่อยตามสิ่งที่คิดในหัว เช่น ข่าวลือนั้นเป็นสิ่งที่พูดไปเรื่อย ไม่เป็นความจริง`,
        choices: ['弾ける (はじける)','請求書 (せいきゅうしょ)','意欲 (いよく)','でたらめに'],
        correct: 4
    },
    {
        quiz: `รถช้า / รถอืด`,
        choices: ['のろい車','錆びる (さびる)','黴 (かび)','なだらかな'],
        correct: 1
    },
    {
        quiz: `ขึ้นสนิม`,
        choices: ['のろい車','錆びる (さびる)','黴 (かび)','なだらかな'],
        correct: 2
    },
    {
        quiz: `เชื้อรา (Mold)`,
        choices: ['のろい車','錆びる (さびる)','黴 (かび)','なだらかな'],
        correct: 3
    },
    {
        quiz: `พื้นผิวไม่ขรุขระ เช่น เนินเรียบ, สภาวะอันสงบ`,
        choices: ['のろい車','錆びる (さびる)','黴 (かび)','なだらかな'],
        correct: 4
    },
    {
        quiz: `ท้าทาย`,
        choices: ['挑戦 (ちょうせん)','痺れる (しびれる)','ゲップする','おなら'],
        correct: 1
    },
    {
        quiz: `ขยับกายไม่ได้ ประสาทชา (ไม่แสบไม่เจ็บ) อีกความหมายที่ไม่อยู่ในพจนานุกรมญี่ปุ่นคือ ตราตรึงใจ`,
        choices: ['挑戦 (ちょうせん)','痺れる (しびれる)','ゲップする','おなら'],
        correct: 2
    },
    {
        quiz: `เรอ`,
        choices: ['挑戦 (ちょうせん)','痺れる (しびれる)','ゲップする','おなら'],
        correct: 3
    },
    {
        quiz: `ตด (คำสุภาพ)`,
        choices: ['挑戦 (ちょうせん)','痺れる (しびれる)','ゲップする','おなら'],
        correct: 4
    },
    {
        quiz: `ถอนหายใจ`,
        choices: ['溜息 (ためいき)','嗽 (うがい)','引っ掻く (ひっかく)','喘ぐ (あえぐ)'],
        correct: 1
    },
    {
        quiz: `บ้วนปาก`,
        choices: ['溜息 (ためいき)','嗽 (うがい)','引っ掻く (ひっかく)','喘ぐ (あえぐ)'],
        correct: 2
    },
    {
        quiz: `เกาด้วยเล็บ / ตัดด้วยดาบ`,
        choices: ['溜息 (ためいき)','嗽 (うがい)','引っ掻く (ひっかく)','喘ぐ (あえぐ)'],
        correct: 3
    },
    {
        quiz: `หอบ หายใจแรง`,
        choices: ['溜息 (ためいき)','嗽 (うがい)','引っ掻く (ひっかく)','喘ぐ (あえぐ)'],
        correct: 4
    },
    {
        quiz: `ล้มละลาย`,
        choices: ['倒産 (とうさん)','皮肉 (ひにく)','潜める (ひそめる)','商店街 (しょうてんまち)'],
        correct: 1
    },
    {
        quiz: `ประชดประชัน`,
        choices: ['倒産 (とうさん)','皮肉 (ひにく)','潜める (ひそめる)','商店街 (しょうてんまち)'],
        correct: 2
    },
    {
        quiz: `ซ่อนตัวในเงามืด ซ่อนเสียง (พยายามทำเสียงแหบเบา)`,
        choices: ['倒産 (とうさん)','皮肉 (ひにく)','潜める (ひそめる)','商店街 (しょうてんまち)'],
        correct: 3
    },
    {
        quiz: `ย่านการค้า`,
        choices: ['倒産 (とうさん)','皮肉 (ひにく)','潜める (ひそめる)','商店街 (しょうてんまち)'],
        correct: 4
    },
    {
        quiz: `ง่าย`,
        choices: ['チョロい','逃走 (とうそう)','困惑 (こんわく)','然るべき (しかるべき)'],
        correct: 1
    },
    {
        quiz: `หลีกหนี จากการต่อสู้`,
        choices: ['チョロい','逃走 (とうそう)','困惑 (こんわく)','然るべき (しかるべき)'],
        correct: 2
    },
    {
        quiz: `สับสน ไม่รู้ว่าต้องทำยังไงต่อ`,
        choices: ['チョロい','逃走 (とうそう)','困惑 (こんわく)','然るべき (しかるべき)'],
        correct: 3
    },
    {
        quiz: `เหมาะสม หมายถึงพฤติกรรมหรือสถานะที่เหมาะต่อสถานการณ์หรือเงื่อนไขใด ๆ`,
        choices: ['チョロい','逃走 (とうそう)','困惑 (こんわく)','然るべき (しかるべき)'],
        correct: 4
    },
    {
        quiz: `หลีกเลี่ยง`,
        choices: ['避ける (よける)','除ける (のぞける)','視聴者 (しちょうしゃ)','容疑者 (ようぎしゃ)'],
        correct: 1
    },
    {
        quiz: `ลบ`,
        choices: ['避ける (よける)','除ける (のぞける)','視聴者 (しちょうしゃ)','容疑者 (ようぎしゃ)'],
        correct: 2
    },
    {
        quiz: `ผู้ชมทางบ้าน หมายถึง ทีวี รวมวิทยุด้วย`,
        choices: ['避ける (よける)','除ける (のぞける)','視聴者 (しちょうしゃ)','容疑者 (ようぎしゃ)'],
        correct: 3
    },
    {
        quiz: `ผู้ต้องสงสัย`,
        choices: ['避ける (よける)','除ける (のぞける)','視聴者 (しちょうしゃ)','容疑者 (ようぎしゃ)'],
        correct: 4
    },
    {
        quiz: `พยายามฆาตกรรม`,
        choices: ['殺人未遂 (さつじんみすい)','甲斐がない (かいがない)','戯れる (たわむれる)','乞うご期待 (こうごきたい)'],
        correct: 1
    },
    {
        quiz: `ไม่มีประโยชน์ที่จะทำ ไม่คุ้ม`,
        choices: ['殺人未遂 (さつじんみすい)','甲斐がない (かいがない)','戯れる (たわむれる)','乞うご期待 (こうごきたい)'],
        correct: 2
    },
    {
        quiz: `เล่นสนุก เช่น สุนัขเล่นสนุก หรือความหมายอื่น คือ ล้อเลียน แกล้งหลอกคนอื่น หรือเล่ามุขตลกได้ด้วย`,
        choices: ['殺人未遂 (さつじんみすい)','甲斐がない (かいがない)','戯れる (たわむれる)','乞うご期待 (こうごきたい)'],
        correct: 3
    },
    {
        quiz: `รอติดตามชม เป็นสำนวนทางทีวีที่ผู้จัดรายการพูดเพื่อขอให้ผู้ชมรอติดตาม`,
        choices: ['殺人未遂 (さつじんみすい)','甲斐がない (かいがない)','戯れる (たわむれる)','乞うご期待 (こうごきたい)'],
        correct: 4
    },
    {
        quiz: `จานใหญ่ (L)`,
        choices: ['大盛り (おおもり)','並盛 (なみもり)','少なめ (すくなめ)','やかましい'],
        correct: 1
    },
    {
        quiz: `จานปกติ (M)`,
        choices: ['大盛り (おおもり)','並盛 (なみもり)','少なめ (すくなめ)','やかましい'],
        correct: 2
    },
    {
        quiz: `จานเล็ก (S)`,
        choices: ['大盛り (おおもり)','並盛 (なみもり)','少なめ (すくなめ)','やかましい'],
        correct: 3
    },
    {
        quiz: `เสียงดังจอแจ น่ารำคาญ`,
        choices: ['大盛り (おおもり)','並盛 (なみもり)','少なめ (すくなめ)','やかましい'],
        correct: 4
    },
    {
        quiz: `งานเลี้ยงสังสรรค์ หมายถึง งานเสริมสัมพันธ์ด้วยการกินดื่มด้วยกัน 4 คนขึ้นไป`,
        choices: ['宴会 (えんかい)','奢る (おごる)','詐欺師 (さぎし)','鵜呑み (うのみ)'],
        correct: 1
    },
    {
        quiz: `เลี้ยงข้าว`,
        choices: ['宴会 (えんかい)','奢る (おごる)','詐欺師 (さぎし)','鵜呑み (うのみ)'],
        correct: 2
    },
    {
        quiz: `นักหลอกลวงต้มตุ๋น`,
        choices: ['宴会 (えんかい)','奢る (おごる)','詐欺師 (さぎし)','鵜呑み (うのみ)'],
        correct: 3
    },
    {
        quiz: `การยอมรับความคิดเห็นของคนอื่นโดยปราศจากความเข้าใจ สำนวนนี้มาจากนกกาน้ำที่กลืนปลาทั้งตัว รากศัพท์คำว่าดื่มในที่นี้แปลได้ทั้งดื่มเหล้าสาเกและสิ่งที่นอกเหนือจากของเหลว และหมายรวมถึงการยอมรับเงื่อนไข/คำขอ`,
        choices: ['宴会 (えんかい)','奢る (おごる)','詐欺師 (さぎし)','鵜呑み (うのみ)'],
        correct: 4
    },
    {
        quiz: `ประหม่า (Nervous)`,
        choices: ['神経質 (しんけいしつ)','儀式 (ぎしき)','草臥れた (くたびれた)','図図しい (ずうずうしい)'],
        correct: 1
    },
    {
        quiz: `พิธีกรรม หมายถึง กิจกรรมทางความเชื่อ ลัทธิ หรือศาสนา หรือหมายรวมถึงพิธีการทางสังคมด้วยในบางครั้ง`,
        choices: ['神経質 (しんけいしつ)','儀式 (ぎしき)','草臥れた (くたびれた)','図図しい (ずうずうしい)'],
        correct: 2
    },
    {
        quiz: `เหนื่อยหลังจากใช้ร่างกายหรือความคิดมานาน หรือ สูญเสียพลังความเยาว์วัยเนื่องจากแก่ชรา`,
        choices: ['神経質 (しんけいしつ)','儀式 (ぎしき)','草臥れた (くたびれた)','図図しい (ずうずうしい)'],
        correct: 3
    },
    {
        quiz: `เห็นแก่ตัวและตรงไปตรงมาโดยไม่เห็นแก่ความสะดวกใจของผู้อื่น`,
        choices: ['神経質 (しんけいしつ)','儀式 (ぎしき)','草臥れた (くたびれた)','図図しい (ずうずうしい)'],
        correct: 4
    },
    {
        quiz: `การอุทิศ หมายถึง สนับสนุนเพื่อเป็นประโยชน์กับอะไรสักอย่างหรือสังคม`,
        choices: ['貢献 (こうけん)','塀 (へい)','金融 (きんゆう)','解散 (かいさん)'],
        correct: 1
    },
    {
        quiz: `กำแพง/รั้วบ้าน คันจิตัวนี้หมายถึง อะไรสักอย่างที่เอาไว้กันเขตบ้าน มีคันจิอีกตัว คือ 垣 (かき) ความหมายคล้ายกัน แต่ใช้พูดถึงกำแพงรั้วบ้านที่บล็อกทัศนวิสัยน้อยกว่า บางคนก็บอกว่าสองตัวนี้ใช้เหมือนกันเลย`,
        choices: ['貢献 (こうけん)','塀 (へい)','金融 (きんゆう)','解散 (かいさん)'],
        correct: 2
    },
    {
        quiz: `การเงิน เช่น การฝากเงินกับธนาคาร การลงทุนในหุ้น หรือทรัพย์สินอื่น ๆ`,
        choices: ['貢献 (こうけん)','塀 (へい)','金融 (きんゆう)','解散 (かいさん)'],
        correct: 3
    },
    {
        quiz: `เลิกกิจการ หมายถึง การที่บริษัทหยุดทำกิจกรรม อาจจะโดยสมัครใจ ล้มละลาย หรือเป็นผลจากกฏหมายบังคับ ยุบสภาก็นับ`,
        choices: ['貢献 (こうけん)','塀 (へい)','金融 (きんゆう)','解散 (かいさん)'],
        correct: 4
    },
    {
        quiz: `การประจบ เยินยอ`,
        choices: ['媚びる (こびる)','媚薬 (びやく)','警戒 (けいかい)','くすぐったい'],
        correct: 1
    },
    {
        quiz: `ยาเสน่ห์ (aphrodisiac)`,
        choices: ['媚びる (こびる)','媚薬 (びやく)','警戒 (けいかい)','くすぐったい'],
        correct: 2
    },
    {
        quiz: `การเฝ้าระวังต่ออันตรายหรือภัยพิบัติ`,
        choices: ['媚びる (こびる)','媚薬 (びやく)','警戒 (けいかい)','くすぐったい'],
        correct: 3
    },
    {
        quiz: `คัน ๆ จักจี้`,
        choices: ['媚びる (こびる)','媚薬 (びやく)','警戒 (けいかい)','くすぐったい'],
        correct: 4
    },
    {
        quiz: `ความโหดร้าย หมายถึง การกระทำอันป่าเถื่อนที่ยากจะมอง`,
        choices: ['残酷 (ざんこく)','仲介 (ちゅうかい)','勇ましい (いさましい)','臆病な (おくびょうな)'],
        correct: 1
    },
    {
        quiz: `การเป็นคนกลาง ไกล่เกลี่ยระหว่างสองฝ่าย ทั้งในแง่เรื่องพิพาท และการค้าขาย`,
        choices: ['残酷 (ざんこく)','仲介 (ちゅうかい)','勇ましい (いさましい)','臆病な (おくびょうな)'],
        correct: 2
    },
    {
        quiz: `กล้าหาญ`,
        choices: ['残酷 (ざんこく)','仲介 (ちゅうかい)','勇ましい (いさましい)','臆病な (おくびょうな)'],
        correct: 3
    },
    {
        quiz: `ขี้ขลาด`,
        choices: ['残酷 (ざんこく)','仲介 (ちゅうかい)','勇ましい (いさましい)','臆病な (おくびょうな)'],
        correct: 4
    },
    // คำศัพท์ N2
    {
        quiz: `โอกาสที่จะทำอะไรใหม่ ๆ`,
        choices: ['契機 (けいき)','先端 (せんたん)','始発 (しはつ)','合図 (あいず)'],
        correct: 1
    },
    {
        quiz: `ปลาย, แนวหน้า, นำสมัย`,
        choices: ['契機 (けいき)','先端 (せんたん)','始発 (しはつ)','合図 (あいず)'],
        correct: 2
    },
    {
        quiz: `ต้นทาง, ออกเป็นขบวนแรก`,
        choices: ['契機 (けいき)','先端 (せんたん)','始発 (しはつ)','合図 (あいず)'],
        correct: 3
    },
    {
        quiz: `สัญญาณ, สัญลักษณ์`,
        choices: ['契機 (けいき)','先端 (せんたん)','始発 (しはつ)','合図 (あいず)'],
        correct: 4
    },
    // คลังศัพท์มือถือ
    {
        quiz: `บัตรอวยพรปีใหม่`,
        choices: ['年賀状 (ねんがじょう)','進捗 (ちんちょく)','憂鬱 (ゆううつ)','領収書 (りょうしゅうしょ)'],
        correct: 1
    },
    {
        quiz: `ความคืบหน้า`,
        choices: ['年賀状 (ねんがじょう)','進捗 (ちんちょく)','憂鬱 (ゆううつ)','領収書 (りょうしゅうしょ)'],
        correct: 2
    },
    {
        quiz: `หม่นหมอง เช่น ซึมจากงานหนัก หรือ สภาวะที่ป่าไม้ใบหญ้าปกคลุมจนมืดมิดก็เรียกได้`,
        choices: ['年賀状 (ねんがじょう)','進捗 (ちんちょく)','憂鬱 (ゆううつ)','領収書 (りょうしゅうしょ)'],
        correct: 3
    },
    {
        quiz: `ใบเสร็จ เอกสารหลักฐานว่าเราจ่ายเงินแล้ว (กรณีเป็นใบแจ้งหนี้และเรายังไม่จ่าย เรียก 請求書)`,
        choices: ['年賀状 (ねんがじょう)','進捗 (ちんちょく)','憂鬱 (ゆううつ)','領収書 (りょうしゅうしょ)'],
        correct: 4
    },
    {
        quiz: `ฟิวชั่น (Fusion) หมายถึง การหลอมรวมวัตถุเข้าด้วยกันเป็นหนึ่ง`,
        choices: ['融合 (ゆうごう)','無垢 (むく)','審判 (しんぱん)','孕む (はらむ)'],
        correct: 1
    },
    {
        quiz: `บริสุทธิ์ หมายถึง ไม่แปดเปื้อนไปด้วยความปรารถนาของใคร อาจหมายรวมถึงชุดกิโมโนที่มีสีเดียวกันทั้งด้านนอกด้านใน โดยเฉพาะชุดกิโมโนสีขาวสำหรับแต่งงาน`,
        choices: ['融合 (ゆうごう)','無垢 (むく)','審判 (しんぱん)','孕む (はらむ)'],
        correct: 2
    },
    {
        quiz: `การพิพากษาถูกผิด โดยรับฟังเสียงประชาชน หรือ การขึ้นชั้นศาล ในแง่การมาฟังคดี และพิพากษาว่าถูกหรือผิด`,
        choices: ['融合 (ゆうごう)','無垢 (むく)','審判 (しんぱん)','孕む (はらむ)'],
        correct: 3
    },
    {
        quiz: `ท้อง ที่หมายถึงตั้งครรภ์`,
        choices: ['融合 (ゆうごう)','無垢 (むく)','審判 (しんぱん)','孕む (はらむ)'],
        correct: 4
    },
    {
        quiz: `เทียน`,
        choices: ['蝋燭 (ろうそく)','食物繊維 (しょくもつせんい)','紙幣 (しへい)','惹き付ける (ひきつける)'],
        correct: 1
    },
    {
        quiz: `กากใยอาหาร`,
        choices: ['蝋燭 (ろうそく)','食物繊維 (しょくもつせんい)','紙幣 (しへい)','惹き付ける (ひきつける)'],
        correct: 2
    },
    {
        quiz: `เงินกระดาษ/ธนบัตร`,
        choices: ['蝋燭 (ろうそく)','食物繊維 (しょくもつせんい)','紙幣 (しへい)','惹き付ける (ひきつける)'],
        correct: 3
    },
    {
        quiz: `ดึงดูดความสนใจ / หว่านเสน่ห์`,
        choices: ['蝋燭 (ろうそく)','食物繊維 (しょくもつせんい)','紙幣 (しへい)','惹き付ける (ひきつける)'],
        correct: 4
    },
    // manga words
    {
        quiz: `องค์กร ในความหมายรวมถึง บริษัท โรงเรียน ตัวแทนรัฐ องค์กรไม่แสวงหาผลกำไร`,
        choices: ['組織 (そしき)','成り立たない (なりたたない)','覆す (くつがえす)','要件 (ようけん)'],
        correct: 1
    },
    {
        quiz: `ไม่ได้ หมายถึง เงื่อนไขไม่ตรง สิ่งต่าง ๆ ไม่กลายเป็นจริง`,
        choices: ['組織 (そしき)','成り立たない (なりたたない)','覆す (くつがえす)','要件 (ようけん)'],
        correct: 2
    },
    {
        quiz: `พลิกหน้าเป็นหลัง / โค่นล้มหรือทำลาย รัฐบาล เป็นต้น`,
        choices: ['組織 (そしき)','成り立たない (なりたたない)','覆す (くつがえす)','要件 (ようけん)'],
        correct: 3
    },
    {
        quiz: `ธุระสำคัญ / เงื่อนไขที่จำเป็น (คุณสมบัติ)`,
        choices: ['組織 (そしき)','成り立たない (なりたたない)','覆す (くつがえす)','要件 (ようけん)'],
        correct: 4
    },
    {
        quiz: `ชดเชย`,
        choices: ['補う (おぎなう)','使役 (しえき)','天敵 (てんてき)','品性 (ひんせい)'],
        correct: 1
    },
    {
        quiz: `การใช้คนอื่นทำงาน (employing)`,
        choices: ['補う (おぎなう)','使役 (しえき)','天敵 (てんてき)','品性 (ひんせい)'],
        correct: 2
    },
    {
        quiz: `ศัตรูโดยธรรมชาติ`,
        choices: ['補う (おぎなう)','使役 (しえき)','天敵 (てんてき)','品性 (ひんせい)'],
        correct: 3
    },
    {
        quiz: `ความเป็นตัวตน = มุมมองหรือมูลค่าทางศีลธรรมที่คนคนนึงยึดถือ`,
        choices: ['補う (おぎなう)','使役 (しえき)','天敵 (てんてき)','品性 (ひんせい)'],
        correct: 4
    },
    {
        quiz: `เป็นเกียรติ หมายถึง ได้รับการยอมรับ ห่อหุ้มด้วยชัยชนะ`,
        choices: ['光栄 (こうえい)','言わんこっちゃない','泥沼 (どろぬま)','低位 (ていい)'],
        correct: 1
    },
    {
        quiz: `ก็บอกแล้วไงเล่า! / เห็นไหมบอกแล้ว (言わないことじゃない)`,
        choices: ['光栄 (こうえい)','言わんこっちゃない','泥沼 (どろぬま)','低位 (ていい)'],
        correct: 2
    },
    {
        quiz: `หล่ม / บ่อโคลน`,
        choices: ['光栄 (こうえい)','言わんこっちゃない','泥沼 (どろぬま)','低位 (ていい)'],
        correct: 3
    },
    {
        quiz: `ระดับล่าง เช่น เวทมนตร์ระดับล่าง`,
        choices: ['光栄 (こうえい)','言わんこっちゃない','泥沼 (どろぬま)','低位 (ていい)'],
        correct: 4
    },
    {
        quiz: `จบเห่ จบการแสดง สิ้นสุดการเล่น พลังเวทหมด ฯลฯ`,
        choices: ['打ち止め (うちどめ)','屡々 (しばしば)','悠長 (ゆうちょう)','鎖 (くさり)'],
        correct: 1
    },
    {
        quiz: `บ่อย ๆ`,
        choices: ['打ち止め (うちどめ)','屡々 (しばしば)','悠長 (ゆうちょう)','鎖 (くさり)'],
        correct: 2
    },
    {
        quiz: `อย่างสบายใจ / อย่างใจเย็น`,
        choices: ['打ち止め (うちどめ)','屡々 (しばしば)','悠長 (ゆうちょう)','鎖 (くさり)'],
        correct: 3
    },
    {
        quiz: `โซ่`,
        choices: ['打ち止め (うちどめ)','屡々 (しばしば)','悠長 (ゆうちょう)','鎖 (くさり)'],
        correct: 4
    },
    {
        quiz: `การเรียนรู้`,
        choices: ['習得 (しゅうとく)','直々に (じきじきに)','雑魚 (ざこ)','其奴 (そやつ/そいつ)'],
        correct: 1
    },
    {
        quiz: `โดยตรง`,
        choices: ['習得 (しゅうとく)','直々に (じきじきに)','雑魚 (ざこ)','其奴 (そやつ/そいつ)'],
        correct: 2
    },
    {
        quiz: `ปลาเล็กปลาน้อย (สำนวนหมายถึงเบี้ยล่าง หนอนแมลงวันก็ได้)`,
        choices: ['習得 (しゅうとく)','直々に (じきじきに)','雑魚 (ざこ)','其奴 (そやつ/そいつ)'],
        correct: 3
    },
    {
        quiz: `เจ้านั่น`,
        choices: ['習得 (しゅうとく)','直々に (じきじきに)','雑魚 (ざこ)','其奴 (そやつ/そいつ)'],
        correct: 4
    },
    {
        quiz: `ข่าวลือ`,
        choices: ['噂 (うわさ)','豚鬼 (とんき)','小鬼 (こおに/しょうき)','相当 (そうとう)'],
        correct: 1
    },
    {
        quiz: `ปีศาจหมู`,
        choices: ['噂 (うわさ)','豚鬼 (とんき)','小鬼 (こおに/しょうき)','相当 (そうとう)'],
        correct: 2
    },
    {
        quiz: `อิมพ์ ปีศาจน้อย`,
        choices: ['噂 (うわさ)','豚鬼 (とんき)','小鬼 (こおに/しょうき)','相当 (そうとう)'],
        correct: 3
    },
    {
        quiz: `เทียบเท่า ระดับนึง`,
        choices: ['噂 (うわさ)','豚鬼 (とんき)','小鬼 (こおに/しょうき)','相当 (そうとう)'],
        correct: 4
    },
    {
        quiz: `ความแข็งแกร่งยิ่ง/คนช่วยแบกของขึ้นเขา`,
        choices: ['剛力 (ごうりき)','暴れる (あばれる)','疎通 (そつう)','意思 (いし)'],
        correct: 1
    },
    {
        quiz: `คลั่ง`,
        choices: ['剛力 (ごうりき)','暴れる (あばれる)','疎通 (そつう)','意思 (いし)'],
        correct: 2
    },
    {
        quiz: `การสื่อสาร`,
        choices: ['剛力 (ごうりき)','暴れる (あばれる)','疎通 (そつう)','意思 (いし)'],
        correct: 3
    },
    {
        quiz: `ความตั้งใจ`,
        choices: ['剛力 (ごうりき)','暴れる (あばれる)','疎通 (そつう)','意思 (いし)'],
        correct: 4
    },
    {
        quiz: `เตรียมการ, ฝึกฝน`,
        choices: ['仕込む (しこむ)','誓う (ちかう)','忠誠 (ちゅうせい)','恐怖 (きょうふ)'],
        correct: 1
    },
    {
        quiz: `สาบาน`,
        choices: ['仕込む (しこむ)','誓う (ちかう)','忠誠 (ちゅうせい)','恐怖 (きょうふ)'],
        correct: 2
    },
    {
        quiz: `ความจงรักภักดี`,
        choices: ['仕込む (しこむ)','誓う (ちかう)','忠誠 (ちゅうせい)','恐怖 (きょうふ)'],
        correct: 3
    },
    {
        quiz: `ความหวาดกลัว`,
        choices: ['仕込む (しこむ)','誓う (ちかう)','忠誠 (ちゅうせい)','恐怖 (きょうふ)'],
        correct: 4
    },
    {
        quiz: `การเชื่อฟัง`,
        choices: ['服従 (ふくじゅう)','収めた (おさめた)','先ず (まず)','宣言 (せんげん)'],
        correct: 1
    },
    {
        quiz: `เก็บรวบรวม`,
        choices: ['服従 (ふくじゅう)','収めた (おさめた)','先ず (まず)','宣言 (せんげん)'],
        correct: 2
    },
    {
        quiz: `ก่อนอื่น`,
        choices: ['服従 (ふくじゅう)','収めた (おさめた)','先ず (まず)','宣言 (せんげん)'],
        correct: 3
    },
    {
        quiz: `การประกาศ`,
        choices: ['服従 (ふくじゅう)','収めた (おさめた)','先ず (まず)','宣言 (せんげん)'],
        correct: 4
    },
    {
        quiz: `ควรเป็น`,
        choices: ['筈だ (はずだ)','戦利品 (せんりひん)','退化 (たいか)','奪う (うばう)'],
        correct: 1
    },
    {
        quiz: `ของเก็บได้ (Loot)`,
        choices: ['筈だ (はずだ)','戦利品 (せんりひん)','退化 (たいか)','奪う (うばう)'],
        correct: 2
    },
    {
        quiz: `การเสื่อมถอย`,
        choices: ['筈だ (はずだ)','戦利品 (せんりひん)','退化 (たいか)','奪う (うばう)'],
        correct: 3
    },
    {
        quiz: `ปล้น/เอาไป`,
        choices: ['筈だ (はずだ)','戦利品 (せんりひん)','退化 (たいか)','奪う (うばう)'],
        correct: 4
    },
    {
        quiz: `ศักดิ์ศรี`,
        choices: ['尊厳 (そんげん)','敗北 (はいぼく)','失われた (うしなわれた)','野蛮 (やばん)'],
        correct: 1
    },
    {
        quiz: `ความพ่ายแพ้`,
        choices: ['尊厳 (そんげん)','敗北 (はいぼく)','失われた (うしなわれた)','野蛮 (やばん)'],
        correct: 2
    },
    {
        quiz: `พ่ายแพ้`,
        choices: ['尊厳 (そんげん)','敗北 (はいぼく)','失われた (うしなわれた)','野蛮 (やばん)'],
        correct: 3
    },
    {
        quiz: `ความป่าเถื่อน`,
        choices: ['尊厳 (そんげん)','敗北 (はいぼく)','失われた (うしなわれた)','野蛮 (やばん)'],
        correct: 4
    },
    {
        quiz: `แหล่งอาศัย`,
        choices: ['生息 (せいそく)','〜たるもの','造る (つくる)','多種多様 (たしゅたよう)'],
        correct: 1
    },
    {
        quiz: `ในฐานะที่เป็น..`,
        choices: ['生息 (せいそく)','〜たるもの','造る (つくる)','多種多様 (たしゅたよう)'],
        correct: 2
    },
    {
        quiz: `สร้าง`,
        choices: ['生息 (せいそく)','〜たるもの','造る (つくる)','多種多様 (たしゅたよう)'],
        correct: 3
    },
    {
        quiz: `ต่าง ๆ นา ๆ / หลากหลาย`,
        choices: ['生息 (せいそく)','〜たるもの','造る (つくる)','多種多様 (たしゅたよう)'],
        correct: 4
    },
    {
        quiz: `การก่อสร้าง`,
        choices: ['建造 (けんぞう)','建築 (けんちく)','簡素 (かんそ)','真実 (しんじつ)'],
        correct: 1
    },
    {
        quiz: `สถาปัตยกรรม`,
        choices: ['建造 (けんぞう)','建築 (けんちく)','簡素 (かんそ)','真実 (しんじつ)'],
        correct: 2
    },
    {
        quiz: `ความเรียบง่าย`,
        choices: ['建造 (けんぞう)','建築 (けんちく)','簡素 (かんそ)','真実 (しんじつ)'],
        correct: 3
    },
    {
        quiz: `ความจริง`,
        choices: ['建造 (けんぞう)','建築 (けんちく)','簡素 (かんそ)','真実 (しんじつ)'],
        correct: 4
    },
    {
        quiz: `อย่างมาก`,
        choices: ['非常 (ひじょう)','行き倒れた','住処 (すみか)','酢 (す)'],
        correct: 1
    },
    {
        quiz: `สลบไป`,
        choices: ['非常 (ひじょう)','行き倒れた','住処 (すみか)','酢 (す)'],
        correct: 2
    },
    {
        quiz: `ที่พักอาศัย`,
        choices: ['非常 (ひじょう)','行き倒れた','住処 (すみか)','酢 (す)'],
        correct: 3
    },
    {
        quiz: `น้ำส้มสายชู`,
        choices: ['非常 (ひじょう)','行き倒れた','住処 (すみか)','酢 (す)'],
        correct: 4
    },
    {
        quiz: `กันสาด`,
        choices: ['雨戸 (あまど)','焚く (たく)','毛糸 (けいと)','実績 (じっせき)'],
        correct: 1
    },
    {
        quiz: `จุดไฟ หรือ เอาอะไรสักอย่างไปวางบนกองไฟ ต้มน้ำร้อนก็นับ ถ้ามีกองไฟ`,
        choices: ['雨戸 (あまど)','焚く (たく)','毛糸 (けいと)','実績 (じっせき)'],
        correct: 2
    },
    {
        quiz: `ไหมพรม`,
        choices: ['雨戸 (あまど)','焚く (たく)','毛糸 (けいと)','実績 (じっせき)'],
        correct: 3
    },
    {
        quiz: `ความสำเร็จ (Achievements)`,
        choices: ['雨戸 (あまど)','焚く (たく)','毛糸 (けいと)','実績 (じっせき)'],
        correct: 4
    },
    {
        quiz: `หนังสือพิมพ์ตอนเย็น`,
        choices: ['夕刊 (ゆうかん)','特殊 (とくしゅ)','吊す (つるす)','腰が反った (こしがかえった)'],
        correct: 1
    },
    {
        quiz: `ลักษณะพิเศษ`,
        choices: ['夕刊 (ゆうかん)','特殊 (とくしゅ)','吊す (つるす)','腰が反った (こしがかえった)'],
        correct: 2
    },
    {
        quiz: `แขวน`,
        choices: ['夕刊 (ゆうかん)','特殊 (とくしゅ)','吊す (つるす)','腰が反った (こしがかえった)'],
        correct: 3
    },
    {
        quiz: `หลังแอ่น`,
        choices: ['夕刊 (ゆうかん)','特殊 (とくしゅ)','吊す (つるす)','腰が反った (こしがかえった)'],
        correct: 4
    },
    {
        quiz: `อาศัย`,
        choices: ['棲む (すむ)','本拠地 (ほんきょち)','洞窟 (どうくつ)','薄汚い (うすぎたない)'],
        correct: 1
    },
    {
        quiz: `ศูนย์บัญชาการ ฐานหลัก`,
        choices: ['棲む (すむ)','本拠地 (ほんきょち)','洞窟 (どうくつ)','薄汚い (うすぎたない)'],
        correct: 2
    },
    {
        quiz: `ถ้ำ`,
        choices: ['棲む (すむ)','本拠地 (ほんきょち)','洞窟 (どうくつ)','薄汚い (うすぎたない)'],
        correct: 3
    },
    {
        quiz: `สกปรกคับแคบ`,
        choices: ['棲む (すむ)','本拠地 (ほんきょち)','洞窟 (どうくつ)','薄汚い (うすぎたない)'],
        correct: 4
    },
    {
        quiz: `อพยพฉุกเฉิน`,
        choices: ['緊急避難 (きんきゅうひなん)','コクコク','沽券 (こけん)','関わる (かかわる)'],
        correct: 1
    },
    {
        quiz: `ผงกหัว พยักหน้า`,
        choices: ['緊急避難 (きんきゅうひなん)','コクコク','沽券 (こけん)','関わる (かかわる)'],
        correct: 2
    },
    {
        quiz: `ภาพลักษณ์ / ชื่อเสียง`,
        choices: ['緊急避難 (きんきゅうひなん)','コクコク','沽券 (こけん)','関わる (かかわる)'],
        correct: 3
    },
    {
        quiz: `เกี่ยวข้อง`,
        choices: ['緊急避難 (きんきゅうひなん)','コクコク','沽券 (こけん)','関わる (かかわる)'],
        correct: 4
    },
    {
        quiz: `หมากเบี้ยในมือ (โชกิ) / ลูกน้อง`,
        choices: ['手駒に (てごまに)','源 (みなもと)','憤り (いきどおり)','強者 (つわもの)'],
        correct: 1
    },
    {
        quiz: `แหล่ง ต้นกำเนิด`,
        choices: ['手駒に (てごまに)','源 (みなもと)','憤り (いきどおり)','強者 (つわもの)'],
        correct: 2
    },
    {
        quiz: `ความขุ่นเคือง`,
        choices: ['手駒に (てごまに)','源 (みなもと)','憤り (いきどおり)','強者 (つわもの)'],
        correct: 3
    },
    {
        quiz: `ผู้แข็งแกร่ง`,
        choices: ['手駒に (てごまに)','源 (みなもと)','憤り (いきどおり)','強者 (つわもの)'],
        correct: 4
    },
    {
        quiz: `ผู้อ่อนแอ`,
        choices: ['弱者 (じゃくしゃ)','悠々 (ゆうゆう)','平伏 (へいふく)','邪神 (じゃしん)'],
        correct: 1
    },
    {
        quiz: `อย่างสบายใจ`,
        choices: ['弱者 (じゃくしゃ)','悠々 (ゆうゆう)','平伏 (へいふく)','邪神 (じゃしん)'],
        correct: 2
    },
    {
        quiz: `การนอนคว่ำ (Prostration)`,
        choices: ['弱者 (じゃくしゃ)','悠々 (ゆうゆう)','平伏 (へいふく)','邪神 (じゃしん)'],
        correct: 3
    },
    {
        quiz: `เทพภัยพิบัติ/เทพปีศาจ`,
        choices: ['弱者 (じゃくしゃ)','悠々 (ゆうゆう)','平伏 (へいふく)','邪神 (じゃしん)'],
        correct: 4
    },
    {
        quiz: `ถือตัว/หยิ่งผยอง มาจากคำว่า 惚れる แปลว่าลุ่มหลง`,
        choices: ['自惚れる (うぬぼれる)','憐憫 (れんびん)','縄張り (なわばり)','縄張り争い (なわばりあらそい)'],
        correct: 1
    },
    {
        quiz: `สงสาร เห็นใจ`,
        choices: ['自惚れる (うぬぼれる)','憐憫 (れんびん)','縄張り (なわばり)','縄張り争い (なわばりあらそい)'],
        correct: 2
    },
    {
        quiz: `เขตแดนของสัตว์ (Territory)`,
        choices: ['自惚れる (うぬぼれる)','憐憫 (れんびん)','縄張り (なわばり)','縄張り争い (なわばりあらそい)'],
        correct: 3
    },
    {
        quiz: `สงครามชิงดินแดน มักจะเกิดกับสปีชี่ย์เดียวกัน ปกติสัตว์ต่างสปีชี่ย์จะเลี่ยงปะทะโดยแยกกันอยู่`,
        choices: ['自惚れる (うぬぼれる)','憐憫 (れんびん)','縄張り (なわばり)','縄張り争い (なわばりあらそい)'],
        correct: 4
    },
    {
        quiz: `การชำระเงิน กรณีนี้มีความหมายในแง่ภาระผูกพันต้องจ่าย`,
        choices: ['課金 (かきん)','笊 (ざる)','ザル','〜ざるを得ない'],
        correct: 1
    },
    {
        quiz: `กระด้ง มักจะหมายถึงตะแกรงไม้ไผ่ (竹笊) ที่ใช้รองเส้น ซารุโซบะ (ざる蕎麦)`,
        choices: ['課金 (かきん)','笊 (ざる)','ザル','〜ざるを得ない'],
        correct: 2
    },
    {
        quiz: `กระชอน หรือในอีกความหมายคือ คนทำงานพลาด/ขี้ลืม/ตกหล่น บ่อย ๆ หรือในวงเหล้าจะหมายถึงคนที่ดื่มได้เรื่อย ๆ หรือกฎหมายที่มีช่องโหว่`,
        choices: ['課金 (かきん)','笊 (ざる)','ザル','〜ざるを得ない'],
        correct: 3
    },
    {
        quiz: `ต้องทำอย่างหลีกเลี่ยงไม่ได้`,
        choices: ['課金 (かきん)','笊 (ざる)','ザル','〜ざるを得ない'],
        correct: 4
    },
    {
        quiz: `ชั้นเลิศ ของคุณภาพสูงไม่อาจเปรียบได้ เช่น ในความหมายอร่อยมาก`,
        choices: ['絶品 (ぜっぴん)','愛くるしい','最悪な','目覚ましい (めざましい)'],
        correct: 1
    },
    {
        quiz: `น่าเอ็นดู`,
        choices: ['絶品 (ぜっぴん)','愛くるしい','最悪な','目覚ましい (めざましい)'],
        correct: 2
    },
    {
        quiz: `แย่มาก/สยดสยอง/น่ากลัว`,
        choices: ['絶品 (ぜっぴん)','愛くるしい','最悪な','目覚ましい (めざましい)'],
        correct: 3
    },
    {
        quiz: `น่าทึ่ง`,
        choices: ['絶品 (ぜっぴん)','愛くるしい','最悪な','目覚ましい (めざましい)'],
        correct: 4
    },
    {
        quiz: `อร่อย`,
        choices: ['美味 (びみ)','惚れ惚れしい (ほれぼれしい)','凄まじい (すさまじい)','驚くべき (おどろくべき)'],
        correct: 1
    },
    {
        quiz: `น่าเอ็นดู/น่ารัก`,
        choices: ['美味 (びみ)','惚れ惚れしい (ほれぼれしい)','凄まじい (すさまじい)','驚くべき (おどろくべき)'],
        correct: 2
    },
    {
        quiz: `น่าเกรงขาม`,
        choices: ['美味 (びみ)','惚れ惚れしい (ほれぼれしい)','凄まじい (すさまじい)','驚くべき (おどろくべき)'],
        correct: 3
    },
    {
        quiz: `น่าทึ่ง`,
        choices: ['美味 (びみ)','惚れ惚れしい (ほれぼれしい)','凄まじい (すさまじい)','驚くべき (おどろくべき)'],
        correct: 4
    },
    {
        quiz: `ดื้อแบบซน`,
        choices: ['わんぱく','駄々っ子 (だだっこ)','頑固 (がんこ)','頑迷 (がんめい)'],
        correct: 1
    },
    {
        quiz: `เด็กงอแง`,
        choices: ['わんぱく','駄々っ子 (だだっこ)','頑固 (がんこ)','頑迷 (がんめい)'],
        correct: 2
    },
    {
        quiz: `ดื้อแบบหัวรั้น`,
        choices: ['わんぱく','駄々っ子 (だだっこ)','頑固 (がんこ)','頑迷 (がんめい)'],
        correct: 3
    },
    {
        quiz: `ดื้อแบบดันทุรัง`,
        choices: ['わんぱく','駄々っ子 (だだっこ)','頑固 (がんこ)','頑迷 (がんめい)'],
        correct: 4
    },
    {
        quiz: `เสนาธิการ`,
        choices: ['参謀 (さんぼう)','為す術がない (なすすべがない)','鍛える (きたえる)','失神する (しっしんする)'],
        correct: 1
    },
    {
        quiz: `ไม่สามารถทำอะไรได้ ทำได้เพียงเฝ้ามอง`,
        choices: ['参謀 (さんぼう)','為す術がない (なすすべがない)','鍛える (きたえる)','失神する (しっしんする)'],
        correct: 2
    },
    {
        quiz: `ตีเหล็ก หรือหมายถึง ฝึกฝนซ้ำ ๆ`,
        choices: ['参謀 (さんぼう)','為す術がない (なすすべがない)','鍛える (きたえる)','失神する (しっしんする)'],
        correct: 3
    },
    {
        quiz: `หมดสติ`,
        choices: ['参謀 (さんぼう)','為す術がない (なすすべがない)','鍛える (きたえる)','失神する (しっしんする)'],
        correct: 4
    },
    {
        quiz: `ประมาณนึง`,
        choices: ['そこそこ','狭い','単純 (たんじゅん)','ちょんまげ'],
        correct: 1
    },
    {
        quiz: `แคบ`,
        choices: ['そこそこ','狭い','単純 (たんじゅん)','ちょんまげ'],
        correct: 2
    },
    {
        quiz: `ความเรียบง่าย`,
        choices: ['そこそこ','狭い','単純 (たんじゅん)','ちょんまげ'],
        correct: 3
    },
    {
        quiz: `ผมจุกแบบญี่ปุ่น มักจะเกี่ยวข้องกับยุคเอโอะและซามุไร และเหล่านักซูโม่ในยุคปัจจุบัน`,
        choices: ['そこそこ','狭い','単純 (たんじゅん)','ちょんまげ'],
        correct: 4
    },
    {
        quiz: `รอมานาน`,
        choices: ['せっかくの','生ぬるい (なまぬるい)','まし','侵略 (しんりゃく)'],
        correct: 1
    },
    {
        quiz: `อุ่น หรือ คนครึ่ง ๆ กลาง ๆ`,
        choices: ['せっかくの','生ぬるい (なまぬるい)','まし','侵略 (しんりゃく)'],
        correct: 2
    },
    {
        quiz: `ดีกว่า`,
        choices: ['せっかくの','生ぬるい (なまぬるい)','まし','侵略 (しんりゃく)'],
        correct: 3
    },
    {
        quiz: `การรุกราน`,
        choices: ['せっかくの','生ぬるい (なまぬるい)','まし','侵略 (しんりゃく)'],
        correct: 4
    },
    {
        quiz: `สายไปแล้ว`,
        choices: ['今更だ (いまさらだ)','喧嘩売ってる (けんかうってる)','挑発 (ちょうはつ)','怪魚人 (かいぎょじん)'],
        correct: 1
    },
    {
        quiz: `ท้าตีท้าต่อย ชวนทะเลาะ`,
        choices: ['今更だ (いまさらだ)','喧嘩売ってる (けんかうってる)','挑発 (ちょうはつ)','怪魚人 (かいぎょじん)'],
        correct: 2
    },
    {
        quiz: `ท้าทาย ยั่วยุ ในความหมายทั่วไป ไม่ชวนทะเลาะ`,
        choices: ['今更だ (いまさらだ)','喧嘩売ってる (けんかうってる)','挑発 (ちょうはつ)','怪魚人 (かいぎょじん)'],
        correct: 3
    },
    {
        quiz: `มอนสเตอร์มนุษย์เงือก`,
        choices: ['今更だ (いまさらだ)','喧嘩売ってる (けんかうってる)','挑発 (ちょうはつ)','怪魚人 (かいぎょじん)'],
        correct: 4
    },
    {
        quiz: `ค้อนสายฟ้า`,
        choices: ['雷鎚 (いかづち・らいづち)','子人 (ことな)','操る (あやつる)','系統 (けいとう)'],
        correct: 1
    },
    {
        quiz: `เด็ก ๆ`,
        choices: ['雷鎚 (いかづち・らいづち)','子人 (ことな)','操る (あやつる)','系統 (けいとう)'],
        correct: 2
    },
    {
        quiz: `ปรับใช้ เช่น การปรับใช้พลังเวทให้กลายเป็นเวทมนตร์`,
        choices: ['雷鎚 (いかづち・らいづち)','子人 (ことな)','操る (あやつる)','系統 (けいとう)'],
        correct: 3
    },
    {
        quiz: `ระบบ เส้นสาย เช่น เวทสายธรรมชาติ เวทสายเทวะ`,
        choices: ['雷鎚 (いかづち・らいづち)','子人 (ことな)','操る (あやつる)','系統 (けいとう)'],
        correct: 4
    },
    {
        quiz: `การสาธิต`,
        choices: ['実演 (じつえん)','片っ端から (かたっぱしから)','道中 (どうちゅう)','溶ける （とける）'],
        correct: 1
    },
    {
        quiz: `เรื่อย ๆ เรียง ๆ ไม่หมด เช่น กินไปเรื่อย ๆ ระหว่างทางไม่ยอมหยุด`,
        choices: ['実演 (じつえん)','片っ端から (かたっぱしから)','道中 (どうちゅう)','溶ける （とける）'],
        correct: 2
    },
    {
        quiz: `ระหว่างทาง`,
        choices: ['実演 (じつえん)','片っ端から (かたっぱしから)','道中 (どうちゅう)','溶ける （とける）'],
        correct: 3
    },
    {
        quiz: `ละลาย`,
        choices: ['実演 (じつえん)','片っ端から (かたっぱしから)','道中 (どうちゅう)','溶ける （とける）'],
        correct: 4
    },
    {
        quiz: `สมานรวม หมายถึง สภาพที่สสารรวมเป็นหนึ่งในประมาณพอเหมาะ เช่น รวบรวมพลังเวท`,
        choices: ['まとまった','実技 (じつぎ)','凡庸な (ぼんような)','常識 (じょうしき)'],
        correct: 1
    },
    {
        quiz: `ภาคปฏิบัติ`,
        choices: ['まとまった','実技 (じつぎ)','凡庸な (ぼんような)','常識 (じょうしき)'],
        correct: 2
    },
    {
        quiz: `ปานกลาง เช่น ผู้ใช้เวทระดับกลาง`,
        choices: ['まとまった','実技 (じつぎ)','凡庸な (ぼんような)','常識 (じょうしき)'],
        correct: 3
    },
    {
        quiz: `สามัญสำนึก (common sense)`,
        choices: ['まとまった','実技 (じつぎ)','凡庸な (ぼんような)','常識 (じょうしき)'],
        correct: 4
    },
    {
        quiz: `อัจฉริยะ`,
        choices: ['天才 (てんさい)','形成 (けいせい)','〜のみ','自在 (じざい)'],
        correct: 1
    },
    {
        quiz: `การขึ้นรูป`,
        choices: ['天才 (てんさい)','形成 (けいせい)','〜のみ','自在 (じざい)'],
        correct: 2
    },
    {
        quiz: `เท่านั้น ใช้คล้าย ๆ 〜だけ`,
        choices: ['天才 (てんさい)','形成 (けいせい)','〜のみ','自在 (じざい)'],
        correct: 3
    },
    {
        quiz: `อย่างอิสระ`,
        choices: ['天才 (てんさい)','形成 (けいせい)','〜のみ','自在 (じざい)'],
        correct: 4
    },
    {
        quiz: `ขุ่นเคือง โกรธา`,
        choices: ['憤慨する (ふんがいする)','安堵 (あんど)','頼る (たよる)','感覚 (かんかく)'],
        correct: 1
    },
    {
        quiz: `ความโล่งใจ`,
        choices: ['憤慨する (ふんがいする)','安堵 (あんど)','頼る (たよる)','感覚 (かんかく)'],
        correct: 2
    },
    {
        quiz: `พึ่งพา`,
        choices: ['憤慨する (ふんがいする)','安堵 (あんど)','頼る (たよる)','感覚 (かんかく)'],
        correct: 3
    },
    {
        quiz: `ความรู้สึก / สัมผัส`,
        choices: ['憤慨する (ふんがいする)','安堵 (あんど)','頼る (たよる)','感覚 (かんかく)'],
        correct: 4
    },
    {
        quiz: `การกระทำ การเคลื่อนไหว พฤติกรรม`,
        choices: ['動作 (どうさ)','一部に','操作する (そうさする)','長ける (たける)'],
        correct: 1
    },
    {
        quiz: `บางส่วน`,
        choices: ['動作 (どうさ)','一部に','操作する (そうさする)','長ける (たける)'],
        correct: 2
    },
    {
        quiz: `จัดการ/ควบคุมเครื่องจักรให้ทำงาน หรือควบคุมตัวแปรให้ตัวเองได้เปรียบ`,
        choices: ['動作 (どうさ)','一部に','操作する (そうさする)','長ける (たける)'],
        correct: 3
    },
    {
        quiz: `เชี่ยวชาญ`,
        choices: ['動作 (どうさ)','一部に','操作する (そうさする)','長ける (たける)'],
        correct: 4
    },
    {
        quiz: `หินธรรมดา ไม่ใช่หินเวทมนตร์`,
        choices: ['非魔石 (ひませき)','摂取する (せっしゅする)','器官 (きかん)','まして'],
        correct: 1
    },
    {
        quiz: `กลืนกิน`,
        choices: ['非魔石 (ひませき)','摂取する (せっしゅする)','器官 (きかん)','まして'],
        correct: 2
    },
    {
        quiz: `อวัยวะของร่างกาย`,
        choices: ['非魔石 (ひませき)','摂取する (せっしゅする)','器官 (きかん)','まして'],
        correct: 3
    },
    {
        quiz: `นอกจากนี้ยัง..`,
        choices: ['非魔石 (ひませき)','摂取する (せっしゅする)','器官 (きかん)','まして'],
        correct: 4
    },
    {
        quiz: `ทุก ๆ อย่างที่เป็นไปได้ อาจจะไม่ได้จำกัดแค่สิ่งของ`,
        choices: ['あらゆる','前提 (ぜんてい)','変質 (へんしつ)','万物 (ばんぶつ)'],
        correct: 1
    },
    {
        quiz: `หลักการ สำหรับใช้ในการโต้แย้ง`,
        choices: ['あらゆる','前提 (ぜんてい)','変質 (へんしつ)','万物 (ばんぶつ)'],
        correct: 2
    },
    {
        quiz: `ย้อนวิวัฒนาการ เปลี่ยนแปลง เสื่อมถอย`,
        choices: ['あらゆる','前提 (ぜんてい)','変質 (へんしつ)','万物 (ばんぶつ)'],
        correct: 3
    },
    {
        quiz: `ทุกสรรพสิ่ง ที่เป็นสิ่งของ`,
        choices: ['あらゆる','前提 (ぜんてい)','変質 (へんしつ)','万物 (ばんぶつ)'],
        correct: 4
    },
    {
        quiz: `การใช้งาน/จัดการเครื่องจักร หรือการปฏิบัติกับลูกค้า/คน`,
        choices: ['扱い (あつかい)','縛る (しばる)','A よりも むしろ B','気色悪い (きしょくわるい)'],
        correct: 1
    },
    {
        quiz: `ผูกเชือกสำหรับขนของ เช่น ตอนแยกขยะให้ผูกกองกระดาษลังเป็นปึกไว้`,
        choices: ['扱い (あつかい)','縛る (しばる)','A よりも むしろ B','気色悪い (きしょくわるい)'],
        correct: 2
    },
    {
        quiz: `เลือกอย่างนั้นดีกว่า (prefer B)`,
        choices: ['扱い (あつかい)','縛る (しばる)','A よりも むしろ B','気色悪い (きしょくわるい)'],
        correct: 3
    },
    {
        quiz: `สยอง / แหยะแหยง`,
        choices: ['扱い (あつかい)','縛る (しばる)','A よりも むしろ B','気色悪い (きしょくわるい)'],
        correct: 4
    },
    {
        quiz: `ไม่เป็นไร อย่าใส่ใจเลย`,
        choices: ['別に良い','とっくに','特に (とくに)','剥ぎ取る (はぎとる)'],
        correct: 1
    },
    {
        quiz: `นานมาแล้ว`,
        choices: ['別に良い','とっくに','特に (とくに)','剥ぎ取る (はぎとる)'],
        correct: 2
    },
    {
        quiz: `โดยเฉพาะ`,
        choices: ['別に良い','とっくに','特に (とくに)','剥ぎ取る (はぎとる)'],
        correct: 3
    },
    {
        quiz: `ฉีกออก เช่น เอาหน้ากากอนามัยออก แกะหอยเม่น`,
        choices: ['別に良い','とっくに','特に (とくに)','剥ぎ取る (はぎとる)'],
        correct: 4
    },
    {
        quiz: `ก๊อกน้ำ`,
        choices: ['蛇口 (じゃぐち)','デッドスペース','収納 (しゅうのう)','調整 (ちょうせい)'],
        correct: 1
    },
    {
        quiz: `Dead Space หมายถึง พื้นที่ภายในห้องที่ยากต่อการใช้งาน เช่น หลังประตูตู้เสื้อผ้า ใต้ก๊อกน้ำ`,
        choices: ['蛇口 (じゃぐち)','デッドスペース','収納 (しゅうのう)','調整 (ちょうせい)'],
        correct: 2
    },
    {
        quiz: `การจัดเก็บ (Storage)`,
        choices: ['蛇口 (じゃぐち)','デッドスペース','収納 (しゅうのう)','調整 (ちょうせい)'],
        correct: 3
    },
    {
        quiz: `การปรับ (Adjustment)`,
        choices: ['蛇口 (じゃぐち)','デッドスペース','収納 (しゅうのう)','調整 (ちょうせい)'],
        correct: 4
    },
    {
        quiz: `ตะขอ (Hook)`,
        choices: ['フック','取付け (とりつけ)','根本 (こんぽん/ねもと)','距離 (きょり)'],
        correct: 1
    },
    {
        quiz: `ติดตั้ง`,
        choices: ['フック','取付け (とりつけ)','根本 (こんぽん/ねもと)','距離 (きょり)'],
        correct: 2
    },
    {
        quiz: `รากฐาน เช่น ฐานก๊อกน้ำ`,
        choices: ['フック','取付け (とりつけ)','根本 (こんぽん/ねもと)','距離 (きょり)'],
        correct: 3
    },
    {
        quiz: `ระยะห่าง`,
        choices: ['フック','取付け (とりつけ)','根本 (こんぽん/ねもと)','距離 (きょり)'],
        correct: 4
    },
    {
        quiz: `รูปร่าง`,
        choices: ['形状 (けいじょう)','サッと','取り外し (とりはずし)','火気 (かき)'],
        correct: 1
    },
    {
        quiz: `อย่างรวดเร็ว`,
        choices: ['形状 (けいじょう)','サッと','取り外し (とりはずし)','火気 (かき)'],
        correct: 2
    },
    {
        quiz: `ถอดออก`,
        choices: ['形状 (けいじょう)','サッと','取り外し (とりはずし)','火気 (かき)'],
        correct: 3
    },
    {
        quiz: `ไฟ หรือ ความร้อน เปลว พลังที่มาจากไฟ`,
        choices: ['形状 (けいじょう)','サッと','取り外し (とりはずし)','火気 (かき)'],
        correct: 4
    },
    {
        quiz: `ความเสียหาย`,
        choices: ['破損 (はそん)','用途 (ようと)','廃棄 (はいき)','地方自治体 (ちほうじちたい)'],
        correct: 1
    },
    {
        quiz: `การใช้งาน`,
        choices: ['破損 (はそん)','用途 (ようと)','廃棄 (はいき)','地方自治体 (ちほうじちたい)'],
        correct: 2
    },
    {
        quiz: `การทิ้ง ไม่ใช้งานแล้ว`,
        choices: ['破損 (はそん)','用途 (ようと)','廃棄 (はいき)','地方自治体 (ちほうじちたい)'],
        correct: 3
    },
    {
        quiz: `รัฐบาลท้องถิ่น`,
        choices: ['破損 (はそん)','用途 (ようと)','廃棄 (はいき)','地方自治体 (ちほうじちたい)'],
        correct: 4
    },
    {
        quiz: `การจัดเก็บ เพื่อไม่ให้เสียหายหรือสูญหาย`,
        choices: ['保管 (ほかん)','縦 (たて)','横 (よこ)','マチ'],
        correct: 1
    },
    {
        quiz: `ความยาว`,
        choices: ['保管 (ほかん)','縦 (たて)','横 (よこ)','マチ'],
        correct: 2
    },
    {
        quiz: `ความกว้าง`,
        choices: ['保管 (ほかん)','縦 (たて)','横 (よこ)','マチ'],
        correct: 3
    },
    {
        quiz: `ความสูง`,
        choices: ['保管 (ほかん)','縦 (たて)','横 (よこ)','マチ'],
        correct: 4
    },
    {
        quiz: `สารก่อภูมิแพ้ (Allergens)`,
        choices: ['アレルギー物質 (ぶっしつ)','特定 (とくてい)','コク','全粒粉 (ぜんりゅうふん)'],
        correct: 1
    },
    {
        quiz: `การระบุ`,
        choices: ['アレルギー物質 (ぶっしつ)','特定 (とくてい)','コク','全粒粉 (ぜんりゅうふん)'],
        correct: 2
    },
    {
        quiz: `ความสมบูรณ์ หมายถึง รสชาติครบถ้วนกลมกล่อม`,
        choices: ['アレルギー物質 (ぶっしつ)','特定 (とくてい)','コク','全粒粉 (ぜんりゅうふん)'],
        correct: 3
    },
    {
        quiz: `ธัญพืชไม่ขัดสี`,
        choices: ['アレルギー物質 (ぶっしつ)','特定 (とくてい)','コク','全粒粉 (ぜんりゅうふん)'],
        correct: 4
    },
    {
        quiz: `ประณีต`,
        choices: ['絶妙 (ぜつみょう)','油脂 (ゆし)','食塩 (しょくえん)','小麦ふすま'],
        correct: 1
    },
    {
        quiz: `ไขมัน/น้ำมัน`,
        choices: ['絶妙 (ぜつみょう)','油脂 (ゆし)','食塩 (しょくえん)','小麦ふすま'],
        correct: 2
    },
    {
        quiz: `เกลือแกง`,
        choices: ['絶妙 (ぜつみょう)','油脂 (ゆし)','食塩 (しょくえん)','小麦ふすま'],
        correct: 3
    },
    {
        quiz: `รำข้าวสาลี รำข้าวหมายถึงเยื้อหุ้มที่ขัดสีออกมาจากเมล็ดข้าว`,
        choices: ['絶妙 (ぜつみょう)','油脂 (ゆし)','食塩 (しょくえん)','小麦ふすま'],
        correct: 4
    },
    {
        quiz: `ผงฟู`,
        choices: ['膨脹剤 (ぼうちょうざい)','香料 (こうりょう)','酸化防止剤 (さんかぼうしざい)','賞味期限 (しょうみきげん)'],
        correct: 1
    },
    {
        quiz: `เครื่องปรุงรส`,
        choices: ['膨脹剤 (ぼうちょうざい)','香料 (こうりょう)','酸化防止剤 (さんかぼうしざい)','賞味期限 (しょうみきげん)'],
        correct: 2
    },
    {
        quiz: `สารต้านอนุมูลอิสระ/แอนตี้ออกซิแดนท์`,
        choices: ['膨脹剤 (ぼうちょうざい)','香料 (こうりょう)','酸化防止剤 (さんかぼうしざい)','賞味期限 (しょうみきげん)'],
        correct: 3
    },
    {
        quiz: `วันหมดอายุ`,
        choices: ['膨脹剤 (ぼうちょうざい)','香料 (こうりょう)','酸化防止剤 (さんかぼうしざい)','賞味期限 (しょうみきげん)'],
        correct: 4
    },
    {
        quiz: `เลี่ยงการโดนแสงแดดโดยตรง`,
        choices: ['直射日光をさけ (ちょくしゃにっこう)','株式会社 (かぶしきかいしゃ)','取扱 (とりあつかい)','包装 (ほうそう)'],
        correct: 1
    },
    {
        quiz: `บริษัทจำกัด`,
        choices: ['直射日光をさけ (ちょくしゃにっこう)','株式会社 (かぶしきかいしゃ)','取扱 (とりあつかい)','包装 (ほうそう)'],
        correct: 2
    },
    {
        quiz: `การใช้งาน`,
        choices: ['直射日光をさけ (ちょくしゃにっこう)','株式会社 (かぶしきかいしゃ)','取扱 (とりあつかい)','包装 (ほうそう)'],
        correct: 3
    },
    {
        quiz: `บรรจุภัณฑ์`,
        choices: ['直射日光をさけ (ちょくしゃにっこう)','株式会社 (かぶしきかいしゃ)','取扱 (とりあつかい)','包装 (ほうそう)'],
        correct: 4
    },
    {
        quiz: `ซีลประตูด้านล่าง`,
        choices: ['ドアの底にシール (ドアのそこにシール)','防湿 (ぼうしつ)','装着 (そうちゃく)','過程 (かてい)'],
        correct: 1
    },
    {
        quiz: `กันชื้น`,
        choices: ['ドアの底にシール (ドアのそこにシール)','防湿 (ぼうしつ)','装着 (そうちゃく)','過程 (かてい)'],
        correct: 2
    },
    {
        quiz: `ติดตั้ง/สวม`,
        choices: ['ドアの底にシール (ドアのそこにシール)','防湿 (ぼうしつ)','装着 (そうちゃく)','過程 (かてい)'],
        correct: 3
    },
    {
        quiz: `กระบวนการ`,
        choices: ['ドアの底にシール (ドアのそこにシール)','防湿 (ぼうしつ)','装着 (そうちゃく)','過程 (かてい)'],
        correct: 4
    },
    {
        quiz: `ขอบ`,
        choices: ['端 (はし)','沿って (そって)','隙間 (すきま)','推進 (すいしん)'],
        correct: 1
    },
    {
        quiz: `ตามแนว`,
        choices: ['端 (はし)','沿って (そって)','隙間 (すきま)','推進 (すいしん)'],
        correct: 2
    },
    {
        quiz: `ช่องว่าง เช่น ช่องว่างระหว่างประตูกับพื้น`,
        choices: ['端 (はし)','沿って (そって)','隙間 (すきま)','推進 (すいしん)'],
        correct: 3
    },
    {
        quiz: `การเสริมกำลัง/ดันไปข้างหน้า`,
        choices: ['端 (はし)','沿って (そって)','隙間 (すきま)','推進 (すいしん)'],
        correct: 4
    },
    {
        quiz: `ส่วนเกิน`,
        choices: ['余分な (よぶんな)','擦る (する)','接着剤 (せっちゃくざい)','跡 (あと)'],
        correct: 1
    },
    {
        quiz: `ขัดถู`,
        choices: ['余分な (よぶんな)','擦る (する)','接着剤 (せっちゃくざい)','跡 (あと)'],
        correct: 2
    },
    {
        quiz: `กาว / สารยึดเกาะ`,
        choices: ['余分な (よぶんな)','擦る (する)','接着剤 (せっちゃくざい)','跡 (あと)'],
        correct: 3
    },
    {
        quiz: `ร่องรอย`,
        choices: ['余分な (よぶんな)','擦る (する)','接着剤 (せっちゃくざい)','跡 (あと)'],
        correct: 4
    },
    {
        quiz: `รูฟองน้ำ`,
        choices: ['泡孔 (あわこう)','構造 (こうぞう)','密封 (みっぷう)','幅 (はば)'],
        correct: 1
    },
    {
        quiz: `โครงสร้าง`,
        choices: ['泡孔 (あわこう)','構造 (こうぞう)','密封 (みっぷう)','幅 (はば)'],
        correct: 2
    },
    {
        quiz: `ปิดผนึก`,
        choices: ['泡孔 (あわこう)','構造 (こうぞう)','密封 (みっぷう)','幅 (はば)'],
        correct: 3
    },
    {
        quiz: `ความกว้าง`,
        choices: ['泡孔 (あわこう)','構造 (こうぞう)','密封 (みっぷう)','幅 (はば)'],
        correct: 4
    },
    {
        quiz: `สามก้าว`,
        choices: ['三歩 (みほ)','摩耗 (まもう)','陰干し (かげぼし)','真珠 (しんじゅ)'],
        correct: 1
    },
    {
        quiz: `การขัดถู/สักกร่อน`,
        choices: ['三歩 (みほ)','摩耗 (まもう)','陰干し (かげぼし)','真珠 (しんじゅ)'],
        correct: 2
    },
    {
        quiz: `ตากในที่ร่ม`,
        choices: ['三歩 (みほ)','摩耗 (まもう)','陰干し (かげぼし)','真珠 (しんじゅ)'],
        correct: 3
    },
    {
        quiz: `ไข่มุก`,
        choices: ['三歩 (みほ)','摩耗 (まもう)','陰干し (かげぼし)','真珠 (しんじゅ)'],
        correct: 4
    },
    {
        quiz: `ฝ้าย`,
        choices: ['綿 (わた)','愛用 (あいよう)','ておる、ており、ております','業界 (ぎょうかい)'],
        correct: 1
    },
    {
        quiz: `โปรดปราน`,
        choices: ['綿 (わた)','愛用 (あいよう)','ておる、ており、ております','業界 (ぎょうかい)'],
        correct: 2
    },
    {
        quiz: `กริยารูปถ่อมตัวของ ている`,
        choices: ['綿 (わた)','愛用 (あいよう)','ておる、ており、ております','業界 (ぎょうかい)'],
        correct: 3
    },
    {
        quiz: `อุตสาหกรรม`,
        choices: ['綿 (わた)','愛用 (あいよう)','ておる、ており、ております','業界 (ぎょうかい)'],
        correct: 4
    },
    {
        quiz: `การสั่นไหว`,
        choices: ['震 (しん)','柔軟 (じゅうなん)','腐食 (ふしょく)','優良 (ゆうりょう)'],
        correct: 1
    },
    {
        quiz: `ความยืดหยุ่น`,
        choices: ['震 (しん)','柔軟 (じゅうなん)','腐食 (ふしょく)','優良 (ゆうりょう)'],
        correct: 2
    },
    {
        quiz: `การกัดกร่อน`,
        choices: ['震 (しん)','柔軟 (じゅうなん)','腐食 (ふしょく)','優良 (ゆうりょう)'],
        correct: 3
    },
    {
        quiz: `ยอดเยี่ยม`,
        choices: ['震 (しん)','柔軟 (じゅうなん)','腐食 (ふしょく)','優良 (ゆうりょう)'],
        correct: 4
    },
    {
        quiz: `การพัฒนา`,
        choices: ['開発 (かいはつ)','択の一つ (たくのひとつ)','不都合品 (ふつごうひん)','立替 (たてかえ)'],
        correct: 1
    },
    {
        quiz: `หนึ่งในทางเลือก`,
        choices: ['開発 (かいはつ)','択の一つ (たくのひとつ)','不都合品 (ふつごうひん)','立替 (たてかえ)'],
        correct: 2
    },
    {
        quiz: `สินค้ามีปัญหา`,
        choices: ['開発 (かいはつ)','択の一つ (たくのひとつ)','不都合品 (ふつごうひん)','立替 (たてかえ)'],
        correct: 3
    },
    {
        quiz: `จ่ายเงินแทนคนอื่น`,
        choices: ['開発 (かいはつ)','択の一つ (たくのひとつ)','不都合品 (ふつごうひん)','立替 (たてかえ)'],
        correct: 4
    },
    {
        quiz: `ละอองเกสร`,
        choices: ['花粉 (かふん)','密着 (みっちゃく)','採用 (さいよう)','ポリウレタン'],
        correct: 1
    },
    {
        quiz: `แนบติด เช่น หน้ากากแนบติดหน้า`,
        choices: ['花粉 (かふん)','密着 (みっちゃく)','採用 (さいよう)','ポリウレタン'],
        correct: 2
    },
    {
        quiz: `คัดสรรเพื่อผลประโยชน์ เช่น คัดสรรมนุษย์เข้าทำงาน คัดสรรวัตถุดิบใหม่เพื่อผลิตสินค้า`,
        choices: ['花粉 (かふん)','密着 (みっちゃく)','採用 (さいよう)','ポリウレタン'],
        correct: 3
    },
    {
        quiz: `Polyurethane เป็นชื่อของโพลิเมอร์ชนิดหนึ่ง`,
        choices: ['花粉 (かふん)','密着 (みっちゃく)','採用 (さいよう)','ポリウレタン'],
        correct: 4
    },
    {
        quiz: `การบุกรุก/ทะลวงผ่าน`,
        choices: ['侵入 (しんにゅう)','徹底 (てってい)','感染 (かんせん)','立体 (りったい)'],
        correct: 1
    },
    {
        quiz: `ตลอดทั้งหมด`,
        choices: ['侵入 (しんにゅう)','徹底 (てってい)','感染 (かんせん)','立体 (りったい)'],
        correct: 2
    },
    {
        quiz: `การติดเชื้อ`,
        choices: ['侵入 (しんにゅう)','徹底 (てってい)','感染 (かんせん)','立体 (りったい)'],
        correct: 3
    },
    {
        quiz: `Solid หมายถึง วัตถุในพื้นที่สามมิติ ไม่ได้แบนราบบนระนาบ`,
        choices: ['侵入 (しんにゅう)','徹底 (てってい)','感染 (かんせん)','立体 (りったい)'],
        correct: 4
    },
];