var quizData = [
    // โจทย์คำเลียนเสียงธรรมชาติ
    {
        quiz: `งั่บงั่บ แบบปลา เป็นต้น กินแบบอร่อย`,
        choices: ['ぱくぱく','ぐっすり','うろうろ','そっと'],
        correct: 1
    },
    {
        quiz: `สูงเพรียว สเลนเดอร์`,
        choices: ['しこしこ','すらっと','ぽんと','ぽかん'],
        correct: 2
    },
    {
        quiz: `ลวก ๆ คร่าว ๆ`,
        choices: ['チン','よろよろ','ざっと','とろとろ'],
        correct: 3
    },
    {
        quiz: `เสียงร้องนกพิราบ`,
        choices: ['ぶんぶん','ぴょん','メエメエ','ポッポ'],
        correct: 4
    },
    {
        quiz: `หลุน ๆ บอลกลิ้ง`,
        choices: ['ころころ','ぱりっと','べたべた','くすくす'],
        correct: 1
    },
    {
        quiz: `แนบสนิท, ตรึงเปร๊ยะ`,
        choices: ['くるくる','ぴっちり','ちりちり','とろん'],
        correct: 2
    },
    {
        quiz: `เก่า, เยิน, โทรม`,
        choices: ['びりっと','ぎっしり','ぼろぼろ','きょろきょろ'],
        correct: 3
    },
    {
        quiz: `ล่องลอย บินไปมาช้า ๆ`,
        choices: ['せっせと','ぎゅうぎゅう','ぼろぼろ','ひらひら'],
        correct: 4
    },
    // โจทย์คำกริยาสุรุ N3
    {
        quiz: `ปรับปรุงแก้ไขให้ดีขึ้น`,
        choices: ['改善する','覚悟する','緊張する','供給する'],
        correct: 1
    },
    {
        quiz: `วิจารณ์`,
        choices: ['変更する','批判する','承知する','通過する'],
        correct: 2
    },
    {
        quiz: `แนะนำ, เสนอ`,
        choices: ['増加する','逮捕する','推薦する','宿泊する'],
        correct: 3
    },
    {
        quiz: `ประเมิน`,
        choices: ['感心する','重視する','議論する','評価する'],
        correct: 4
    },
    // โจทย์ไวยากรณ์ N3
    {
        quiz: `ตลอดจนถึง เช่น จนถึงกลางดึก จนถึงสิ้นปี`,
        choices: ['N + にかけて （は）','N + であることか','N + に関する','N + によって'],
        correct: 1
    },
    {
        quiz: `ทันทีที่.. เช่น ทันทีที่ได้ยิน`,
        choices: ['V + ほど','V た + とたん（に）','V dic + ことがある','V + 切る'],
        correct: 2
    },
    {
        quiz: `เป็นที่น่า.. เช่น เป็นที่น่าสะพรึงที่กระต่ายคาบรองเท้ามา`,
        choices: ['まるで + Adj + ようだ','Adj + （だ）としたら','Adj + (な)ことに','Adj + わけだ'],
        correct: 3
    },
    {
        quiz: `ควร เช่น ควรพักผ่อนให้เพียงพอ`,
        choices: ['V + ながらも','V + につれて','V + そうもない','Vdic + ことだ'],
        correct: 4
    },
    // โจทย์คันจิ N3
    {
        quiz: `กล่องดำ`,
        choices: ['暗箱','昏迷','勤労','点ける'],
        correct: 1
    },
    {
        quiz: `การช่วยเหลือ`,
        choices: ['除去','救済','費やす','非難'],
        correct: 2
    },
    {
        quiz: `สนธิสัญญา`,
        choices: ['粉末','付属','条約','約まる'],
        correct: 3
    },
    {
        quiz: `การบริหาร`,
        choices: ['譲渡','登校','探偵','行政'],
        correct: 4
    }
];